/* automatically generated by rust-bindgen 0.69.4 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::core::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::core::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::core::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::core::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::core::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const __GNUC_VA_LIST: u32 = 1;
pub const NRF_WIFI_LOG_LEVEL_ERR: u32 = 1;
pub const NRF_WIFI_LOG_LEVEL_INF: u32 = 3;
pub const NRF_WIFI_LOG_LEVEL_DBG: u32 = 4;
pub const RPU_ADDR_SPI_START: u32 = 0;
pub const RPU_ADDR_GRAM_START: u32 = 3070230528;
pub const RPU_ADDR_GRAM_END: u32 = 3070296575;
pub const RPU_ADDR_SBUS_START: u32 = 2751463424;
pub const RPU_ADDR_SBUS_END: u32 = 2751496191;

pub const NRF_WIFI_GET_WIPHY_VALID_MAX_NUM_SCAN_SSIDS: u32 = 8;
pub const NRF_WIFI_GET_WIPHY_VALID_NUM_SCHED_SCAN_SSIDS: u32 = 16;
pub const NRF_WIFI_GET_WIPHY_VALID_MAX_MATCH_SETS: u32 = 32;
pub const NRF_WIFI_GET_WIPHY_VALID_MAC_ACL_MAX: u32 = 64;
pub const NRF_WIFI_GET_WIPHY_VALID_HAVE_AP_SME: u32 = 128;
pub const NRF_WIFI_GET_WIPHY_VALID_EXTENDED_CAPABILITIES: u32 = 256;
pub const NRF_WIFI_GET_WIPHY_VALID_MAX_AP_ASSOC_STA: u32 = 512;
pub const NRF_WIFI_GET_WIPHY_VALID_WIPHY_NAME: u32 = 1024;
pub const NRF_WIFI_GET_WIPHY_VALID_EXTENDED_FEATURES: u32 = 2048;
pub const NRF_WIFI_EVENT_GET_WIPHY_MAX_CIPHER_COUNT: u32 = 30;
pub const NRF_WIFI_INDEX_IDS_WIPHY_NAME: u32 = 32;
pub const NRF_WIFI_EVENT_GET_WIPHY_NUM_BANDS: u32 = 2;
pub const EXTENDED_FEATURE_LEN: u32 = 60;
pub const REG_RULE_FLAGS_VALID: u32 = 1;
pub const FREQ_RANGE_START_VALID: u32 = 2;
pub const FREQ_RANGE_END_VALID: u32 = 4;
pub const FREQ_RANGE_MAX_BW_VALID: u32 = 8;
pub const POWER_RULE_MAX_EIRP_VALID: u32 = 16;
pub const NRF_WIFI_RULE_FLAGS_NO_OFDM: u32 = 1;
pub const NRF_WIFI_RULE_FLAGS_NO_CCK: u32 = 2;
pub const NRF_WIFI_RULE_FLAGS_NO_INDOOR: u32 = 4;
pub const NRF_WIFI_RULE_FLAGS_NO_OUTDOOR: u32 = 8;
pub const NRF_WIFI_RULE_FLAGS_DFS: u32 = 16;
pub const NRF_WIFI_RULE_FLAGS_PTP_ONLY: u32 = 32;
pub const NRF_WIFI_RULE_FLAGS_PTMP_ONLY: u32 = 64;
pub const NRF_WIFI_RULE_FLAGS_NO_IR: u32 = 128;
pub const NRF_WIFI_RULE_FLAGS_IBSS: u32 = 256;
pub const NRF_WIFI_RULE_FLAGS_AUTO_BW: u32 = 2048;
pub const NRF_WIFI_RULE_FLAGS_IR_CONCURRENT: u32 = 4096;
pub const NRF_WIFI_RULE_FLAGS_NO_HT40MINUS: u32 = 8192;
pub const NRF_WIFI_RULE_FLAGS_NO_HT40PLUS: u32 = 16384;
pub const NRF_WIFI_RULE_FLAGS_NO_80MHZ: u32 = 32768;
pub const NRF_WIFI_RULE_FLAGS_NO_160MHZ: u32 = 65536;
pub const NRF_WIFI_CMD_SET_REG_ALPHA2_VALID: u32 = 1;
pub const NRF_WIFI_CMD_SET_REG_RULES_VALID: u32 = 2;
pub const NRF_WIFI_CMD_SET_REG_DFS_REGION_VALID: u32 = 4;
pub const MAX_NUM_REG_RULES: u32 = 32;
pub const NRF_WIFI_CMD_REQ_SET_REG_ALPHA2_VALID: u32 = 1;
pub const NRF_WIFI_CMD_REQ_SET_REG_USER_REG_HINT_TYPE_VALID: u32 = 2;
pub const NRF_WIFI_CMD_REQ_SET_REG_USER_REG_FORCE: u32 = 4;
pub const MAX_PEERS: u32 = 5;
pub const MAX_SW_PEERS: u32 = 6;
pub const NRF_WIFI_AC_TWT_PRIORITY_EMERGENCY: u32 = 255;
pub const NRF_WIFI_FMAC_STATS_RECV_TIMEOUT: u32 = 50;
pub const NRF_WIFI_FMAC_PS_CONF_EVNT_RECV_TIMEOUT: u32 = 50;
pub const HOST_PKTRAM_BB_START: u32 = 46137344;
pub const HOST_PKTRAM_BB_LEN: u32 = 4194304;
pub const MAX_HAL_RPU_READY_WAIT: u32 = 1000000;
pub type va_list = u32;
pub type __gnuc_va_list = u32;
pub type wchar_t = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::core::ffi::c_longlong,
    pub __clang_max_align_nonce2: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::core::mem::MaybeUninit<max_align_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        16usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        8usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
#[repr(i32)]
#[doc = " enum nrf_wifi_status - The status of an operation performed by the\n                        RPU driver.\n @NRF_WIFI_STATUS_SUCCESS: The operation was successful.\n @NRF_WIFI_STATUS_FAIL: The operation failed.\n\n This enum lists the possible outcomes of an operation performed by the\n RPU driver."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_status {
    NRF_WIFI_STATUS_SUCCESS = 0,
    NRF_WIFI_STATUS_FAIL = -1,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_osal_dma_dir - DMA direction for a DMA operation\n @NRF_WIFI_OSAL_DMA_DIR_TO_DEV: Data needs to be DMAed to the device.\n @NRF_WIFI_DMA_DIR_FROM_DEV: Data needs to be DMAed from the device.\n @NRF_WIFI_DMA_DIR_BIDI: Data can be DMAed in either direction i.e to\n                        or from the device.\n\n This enum lists the possible directions for a DMA operation i.e whether the\n DMA operation is for transferring data to or from a device"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_osal_dma_dir {
    NRF_WIFI_OSAL_DMA_DIR_TO_DEV = 0,
    NRF_WIFI_OSAL_DMA_DIR_FROM_DEV = 1,
    NRF_WIFI_OSAL_DMA_DIR_BIDI = 2,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_tasklet_type - The type of a tasklet\n @NRF_WIFI_TASKLET_TYPE_BH: The tasklet is a bottom half tasklet i.e it is\n\t\tscheduled from an interrupt context used for all except\n\t\tTX done tasklets.\n @NRF_WIFI_TASKLET_TYPE_IRQ: The tasklet is an IRQ tasklet. It is scheduled\n\t\tfrom the Bus ISR, used internally by the SHIM layer.\n @NRF_WIFI_TASKLET_TYPE_TX_DONE: The tasklet is a TX done tasklet. It is\n\t\tscheduled from the BH tasklet for TX done interrupts.\n @NRF_WIFI_TASKLET_TYPE_RX: The tasklet is an RX tasklet. It is scheduled\n\t\tfrom the BH tasklet for RX interrupts.\n @NRF_WIFI_TASKLET_TYPE_MAX: The maximum number of tasklet types.\n\n This enum lists the possible types of a tasklet.\n Each tasklet type is associated with its own work queue."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_tasklet_type {
    NRF_WIFI_TASKLET_TYPE_BH = 0,
    NRF_WIFI_TASKLET_TYPE_IRQ = 1,
    NRF_WIFI_TASKLET_TYPE_TX_DONE = 2,
    NRF_WIFI_TASKLET_TYPE_RX = 3,
    NRF_WIFI_TASKLET_TYPE_MAX = 4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_osal_host_map {
    pub addr: ::core::ffi::c_ulong,
    pub size: ::core::ffi::c_ulong,
}
#[test]
fn bindgen_test_layout_nrf_wifi_osal_host_map() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_osal_host_map> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_osal_host_map>(),
        8usize,
        concat!("Size of: ", stringify!(nrf_wifi_osal_host_map))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_osal_host_map>(),
        4usize,
        concat!("Alignment of ", stringify!(nrf_wifi_osal_host_map))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_osal_host_map),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_osal_host_map),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_osal_priv {
    pub ops: *const nrf_wifi_osal_ops,
}
#[test]
fn bindgen_test_layout_nrf_wifi_osal_priv() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_osal_priv> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_osal_priv>(),
        4usize,
        concat!("Size of: ", stringify!(nrf_wifi_osal_priv))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_osal_priv>(),
        4usize,
        concat!("Alignment of ", stringify!(nrf_wifi_osal_priv))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ops) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_osal_priv),
            "::",
            stringify!(ops)
        )
    );
}
#[repr(u32)]
#[doc = " enum nrf_wifi_assert_type - The type of assertion operation has to be done\n @NRF_WIFI_ASSERT_EQUAL_TO: The assertion check for equality.\n @NRF_WIFI_ASSERT_NOT_EQUAL_TO: The assertion check for non-equality.\n @NRF_WIFI_ASSERT_LESS_THAN: The assertion check for lesser value.\n @NRF_WIFI_ASSERT_LESS_THAN_OR_EQUAL_TO: The assertion check\n\t\tfor equal or lesser.\n @NRF_WIFI_ASSERT_MORE_THAN: The assertion check for condition\n\t\tof more than value.\n @NRF_WIFI_ASSERT_MORE_THAN_OR_EQUAL_TO: The assertion check for condition\n\t\tequal or more than value.\n\n This enum lists the possible type of operation in the assertion\n check should be taken."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_assert_op_type {
    NRF_WIFI_ASSERT_EQUAL_TO = 0,
    NRF_WIFI_ASSERT_NOT_EQUAL_TO = 1,
    NRF_WIFI_ASSERT_LESS_THAN = 2,
    NRF_WIFI_ASSERT_LESS_THAN_EQUAL_TO = 3,
    NRF_WIFI_ASSERT_GREATER_THAN = 4,
    NRF_WIFI_ASSERT_GREATER_THAN_EQUAL_TO = 5,
}
extern "C" {
    #[doc = " nrf_wifi_osal_init() - Initialize the OSAL layer.\n\n Initializes the OSAL layer and is expected to be called\n before using the OSAL layer. Returns a pointer to the OSAL context\n which might need to be passed to further API calls.\n\n Return: Pointer to instance of OSAL context."]
    pub fn nrf_wifi_osal_init() -> *mut nrf_wifi_osal_priv;
}
extern "C" {
    #[doc = " nrf_wifi_osal_deinit() - Deinitialize the OSAL layer.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n\n Deinitializes the OSAL layer and is expected to be called after done using\n the OSAL layer.\n\n Return: None."]
    pub fn nrf_wifi_osal_deinit(opriv: *mut nrf_wifi_osal_priv);
}
extern "C" {
    #[doc = " nrf_wifi_osal_mem_alloc() - Allocate memory.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @size: Size of the memory to be allocated in bytes.\n\n Allocates memory of @size bytes and returns a pointer to the start\n of the memory allocated.\n\n Return:\n\t\tPass: Pointer to start of allocated memory.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_mem_alloc(
        opriv: *mut nrf_wifi_osal_priv,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_mem_zalloc() - Allocated zero-initialized memory.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @size: Size of the memory to be allocated in bytes.\n\n Allocates memory of @size bytes, zeroes it out and returns a pointer to the\n start of the memory allocated.\n\n Return:\n\t\tPass: Pointer to start of allocated memory.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_mem_zalloc(
        opriv: *mut nrf_wifi_osal_priv,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_mem_free() - Free previously allocated memory.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @buf: Pointer to the memory to be freed.\n\n Free up memory which has been allocated using @nrf_wifi_osal_mem_alloc or\n @nrf_wifi_osal_mem_zalloc.\n\n Return: None."]
    pub fn nrf_wifi_osal_mem_free(opriv: *mut nrf_wifi_osal_priv, buf: *mut ::core::ffi::c_void);
}
extern "C" {
    #[doc = " nrf_wifi_osal_mem_cpy() - Copy contents from one memory location to another.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @dest: Pointer to the memory location where contents are to be copied.\n @src: Pointer to the memory location from where contents are to be copied.\n @count: Number of bytes to be copied.\n\n Copies @count number of bytes from @src location in memory to @dest\n location in memory.\n\n Return:\n\t\tPass: Pointer to destination memory.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_mem_cpy(
        opriv: *mut nrf_wifi_osal_priv,
        dest: *mut ::core::ffi::c_void,
        src: *const ::core::ffi::c_void,
        count: usize,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_mem_set() - Fill a block of memory with a particular value.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @start: Pointer to the memory location whose contents are to be set.\n @val: Value to be set.\n @size: Number of bytes to be set.\n\n Fills a block of memory of @size bytes starting at @start with a particular\n value represented by @val.\n\n Return:\n\t\tPass: Pointer to memory location which was set.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_mem_set(
        opriv: *mut nrf_wifi_osal_priv,
        start: *mut ::core::ffi::c_void,
        val: ::core::ffi::c_int,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_iomem_mmap() - Memory map IO memory into CPU space.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @addr: Address of the IO memory to be mapped.\n @size: Size of the IO memory in bytes.\n\n Maps IO memory of @size bytes pointed to by @addr into CPU space.\n\n Return:\n\t\tPass: Pointer to the mapped IO memory.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_iomem_mmap(
        opriv: *mut nrf_wifi_osal_priv,
        addr: ::core::ffi::c_ulong,
        size: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_iomem_unmap() - Unmap previously mapped IO memory from CPU space.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @addr: Pointer to mapped IO memory to be unmapped.\n\n Unmaps IO memory from CPU space that was mapped using @nrf_wifi_osal_iomem_mmap.\n\n Return: None."]
    pub fn nrf_wifi_osal_iomem_unmap(
        opriv: *mut nrf_wifi_osal_priv,
        addr: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_iomem_read_reg32() - Read value from a 32 bit IO memory mapped\n                                   register.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @addr: Pointer to the IO memory mapped register address.\n\n Reads value from a 32 bit device register using a memory mapped\n address(@addr).\n\n Return: 32 bit value read from register."]
    pub fn nrf_wifi_osal_iomem_read_reg32(
        opriv: *mut nrf_wifi_osal_priv,
        addr: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " nrf_wifi_osal_iomem_write_reg32() - Write a 32 bit value to a IO memory mapped register.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @addr: Pointer to the IO memory mapped register address.\n @val: Value to be written to the register.\n\n Writes a 32 bit value (@val) to a 32 bit device register using a memory\n mapped address(@addr).\n\n Return: None."]
    pub fn nrf_wifi_osal_iomem_write_reg32(
        opriv: *mut nrf_wifi_osal_priv,
        addr: *mut ::core::ffi::c_void,
        val: ::core::ffi::c_uint,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_iomem_cpy_from() - Copy data from the memory of a memory\n                                 mapped IO device to host memory.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @dest: Pointer to the host memory where data is to be copied.\n @src: Pointer to the memory of the memory mapped IO device from where\n       data is to be copied.\n @count: The size of the data to be copied in bytes.\n\n Copies a block of data of size @count bytes from memory mapped device\n memory(@src) to host memory(@dest).\n\n Return: None."]
    pub fn nrf_wifi_osal_iomem_cpy_from(
        opriv: *mut nrf_wifi_osal_priv,
        dest: *mut ::core::ffi::c_void,
        src: *const ::core::ffi::c_void,
        count: usize,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_iomem_cpy_to() - Copy data to the memory of a memory\n                               mapped IO device from host memory.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @dest: Pointer to the memory of the memory mapped IO device where\n        data is to be copied.\n @src: Pointer to the host memory from where data is to be copied.\n @count: The size of the data to be copied in bytes.\n\n Copies a block of data of size @count bytes from host memory (@src) to\n memory mapped device memory(@dest).\n\n Return: None."]
    pub fn nrf_wifi_osal_iomem_cpy_to(
        opriv: *mut nrf_wifi_osal_priv,
        dest: *mut ::core::ffi::c_void,
        src: *const ::core::ffi::c_void,
        count: usize,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_spinlock_alloc() - Allocate a busy lock.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n\n Allocates a busy lock.\n\n Return:\n\t\tPass: Pointer to the busy lock instance.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_spinlock_alloc(opriv: *mut nrf_wifi_osal_priv)
        -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_spinlock_free() - Free a busy lock.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @lock: Pointer to a busy lock instance.\n\n Frees a busy lock (@lock) allocated by @nrf_wifi_osal_spinlock_alloc\n\n Return: None."]
    pub fn nrf_wifi_osal_spinlock_free(
        opriv: *mut nrf_wifi_osal_priv,
        lock: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_spinlock_init() - Initialize a busy lock.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @lock: Pointer to a busy lock instance.\n\n Initializes a busy lock (@lock) allocated by @nrf_wifi_osal_spinlock_alloc.\n\n Return: None."]
    pub fn nrf_wifi_osal_spinlock_init(
        opriv: *mut nrf_wifi_osal_priv,
        lock: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_spinlock_take() - Acquire a buys lock.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @lock: Pointer to a busy lock instance.\n\n Acquires a busy lock (@lock) allocated by @nrf_wifi_osal_spinlock_alloc.\n\n Return: None."]
    pub fn nrf_wifi_osal_spinlock_take(
        opriv: *mut nrf_wifi_osal_priv,
        lock: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_spinlock_rel() - Releases a busy lock.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @lock: Pointer to a busy lock instance.\n\n Releases a busy lock (@lock) acquired by @nrf_wifi_osal_spinlock_take.\n\n Return: None."]
    pub fn nrf_wifi_osal_spinlock_rel(
        opriv: *mut nrf_wifi_osal_priv,
        lock: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_spinlock_irq_take() - Acquire a busy lock and disable\n                                    interrupts.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @lock: Pointer to a busy lock instance.\n @flags: Interrupt state flags.\n\n Saves interrupt states (@flags), disable interrupts and take a\n busy lock (@lock).\n\n Return: None."]
    pub fn nrf_wifi_osal_spinlock_irq_take(
        opriv: *mut nrf_wifi_osal_priv,
        lock: *mut ::core::ffi::c_void,
        flags: *mut ::core::ffi::c_ulong,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_spinlock_irq_rel() - Release a busy lock and enable interrupts.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @lock: Pointer to a busy lock instance.\n @flags: Interrupt state flags.\n\n Restores interrupt states (@flags) and releases busy lock (@lock) acquired\n using @nrf_wifi_osal_spinlock_irq_take.\n\n Return: None."]
    pub fn nrf_wifi_osal_spinlock_irq_rel(
        opriv: *mut nrf_wifi_osal_priv,
        lock: *mut ::core::ffi::c_void,
        flags: *mut ::core::ffi::c_ulong,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_llist_node_alloc() - Allocate a linked list mode.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n\n Allocates a linked list node.\n\n Return:\n\t\tPass: Pointer to the linked list node allocated.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_llist_node_alloc(
        opriv: *mut nrf_wifi_osal_priv,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_llist_node_free() - Free a linked list node.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @node: Pointer to a linked list node.\n\n Frees a linked list node(@node) which was allocated by\n @nrf_wifi_osal_llist_node_alloc.\n\n Return: None."]
    pub fn nrf_wifi_osal_llist_node_free(
        opriv: *mut nrf_wifi_osal_priv,
        node: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_llist_node_data_get() - Get data stored in a linked list node.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @node: Pointer to a linked list node.\n\n Gets the pointer to the data which the linked list node(@node) points to.\n\n Return:\n\t\tPass: Pointer to the data stored in the linked list node.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_llist_node_data_get(
        opriv: *mut nrf_wifi_osal_priv,
        node: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_llist_node_data_set() - Set data in a linked list node.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @node: Pointer to a linked list node.\n @data: Pointer to the data to be stored in the linked list node.\n\n Stores the pointer to the data(@data) in a linked list node(@node).\n\n\n Return: None."]
    pub fn nrf_wifi_osal_llist_node_data_set(
        opriv: *mut nrf_wifi_osal_priv,
        node: *mut ::core::ffi::c_void,
        data: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_llist_alloc() - Allocate a linked list.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n\n Allocates a linked list.\n\n Return:\n\t\tPass: Pointer to the allocated linked list.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_llist_alloc(opriv: *mut nrf_wifi_osal_priv) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_llist_free() - Free a linked list.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @llist: Pointer to a linked list.\n\n Frees a linked list(@llist) allocated by @nrf_wifi_osal_llist_alloc.\n\n Return: None."]
    pub fn nrf_wifi_osal_llist_free(
        opriv: *mut nrf_wifi_osal_priv,
        llist: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_llist_init() - Initialize a linked list.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @llist: Pointer to a linked list.\n\n Initializes a linked list(@llist) allocated by @nrf_wifi_osal_llist_alloc.\n\n Return: None."]
    pub fn nrf_wifi_osal_llist_init(
        opriv: *mut nrf_wifi_osal_priv,
        llist: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_llist_add_node_tail() - Add a node to the tail of a linked list.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @llist: Pointer to a linked list.\n @llist_node: Pointer to a linked list node.\n\n Adds a linked list node(@llist_node) allocated by @nrf_wifi_osal_llist_node_alloc\n to the tail of a linked list(@llist) allocated by @nrf_wifi_osal_llist_alloc.\n\n Return: None."]
    pub fn nrf_wifi_osal_llist_add_node_tail(
        opriv: *mut nrf_wifi_osal_priv,
        llist: *mut ::core::ffi::c_void,
        llist_node: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_llist_add_node_head() - Add a node to the head of a linked list.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @llist: Pointer to a linked list.\n @llist_node: Pointer to a linked list node.\n\n Adds a linked list node(@llist_node) allocated by @nrf_wifi_osal_llist_node_alloc\n to the head of a linked list(@llist) allocated by @nrf_wifi_osal_llist_alloc.\n\n Return: None."]
    pub fn nrf_wifi_osal_llist_add_node_head(
        opriv: *mut nrf_wifi_osal_priv,
        llist: *mut ::core::ffi::c_void,
        llist_node: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_llist_get_node_head() - Get the head of a linked list.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @llist: Pointer to a linked list.\n\n Returns the head node from a linked list(@llist) while still leaving the\n node as part of the linked list. If the linked list is empty\n returns NULL.\n\n Return:\n\t\tPass: Pointer to the head of the linked list.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_llist_get_node_head(
        opriv: *mut nrf_wifi_osal_priv,
        llist: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_llist_get_node_nxt() - Get the next node in a linked list.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @llist: Pointer to a linked list.\n @llist_node: Pointer to a linked list node.\n\n Return the node next to the node passed in the @llist_node parameter.\n The node returned is not removed from the linked list.\n\n Return:\n\t\tPass: Pointer to the next node in the linked list.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_llist_get_node_nxt(
        opriv: *mut nrf_wifi_osal_priv,
        llist: *mut ::core::ffi::c_void,
        llist_node: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_llist_del_node() - Delete node from a linked list.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @llist: Pointer to a linked list.\n @llist_node: Pointer to a linked list node.\n\n Removes the node passed in the @llist_node parameter from the linked list\n passed in the @llist parameter.\n\n Return: None."]
    pub fn nrf_wifi_osal_llist_del_node(
        opriv: *mut nrf_wifi_osal_priv,
        llist: *mut ::core::ffi::c_void,
        llist_node: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_llist_len() - Get length of a linked list.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @llist: Pointer to a linked list.\n\n Returns the length of the linked list(@llist).\n\n Return: Linked list length in bytes."]
    pub fn nrf_wifi_osal_llist_len(
        opriv: *mut nrf_wifi_osal_priv,
        llist: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " nrf_wifi_osal_nbuf_alloc() - Allocate a network buffer\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @size: Size in bytes of the network buffer to allocated.\n\n Allocates a network buffer of size @size.\n\n Return:\n\t\tPass: Pointer to the allocated network buffer.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_nbuf_alloc(
        opriv: *mut nrf_wifi_osal_priv,
        size: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_nbuf_free() - Free a network buffer.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @nbuf: Pointer to a network buffer.\n\n Frees a network buffer(@nbuf) which was allocated by\n @nrf_wifi_osal_nbuf_alloc.\n\n Return: None."]
    pub fn nrf_wifi_osal_nbuf_free(opriv: *mut nrf_wifi_osal_priv, nbuf: *mut ::core::ffi::c_void);
}
extern "C" {
    #[doc = " nrf_wifi_osal_nbuf_headroom_res() - Reserve headroom space in a network buffer.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @nbuf: Pointer to a network buffer.\n @size: Size in bytes of the headroom to be reserved.\n\n Reserves headroom of size(@size) bytes at the beginning of the data area of\n a network buffer(@nbuf).\n\n Return: None."]
    pub fn nrf_wifi_osal_nbuf_headroom_res(
        opriv: *mut nrf_wifi_osal_priv,
        nbuf: *mut ::core::ffi::c_void,
        size: ::core::ffi::c_uint,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_nbuf_headroom_get() - Get the size of the headroom in a network buffer.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @nbuf: Pointer to a network buffer.\n\n Gets the size of the reserved headroom at the beginning\n of the data area of a network buffer(@nbuf).\n\n Return: Size of the network buffer data headroom in bytes."]
    pub fn nrf_wifi_osal_nbuf_headroom_get(
        opriv: *mut nrf_wifi_osal_priv,
        nbuf: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " nrf_wifi_osal_nbuf_data_size() - Get the size of data in a network buffer.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @nbuf: Pointer to a network buffer.\n\n Gets the size of the data area of a network buffer(@nbuf).\n\n Return: Size of the network buffer data in bytes."]
    pub fn nrf_wifi_osal_nbuf_data_size(
        opriv: *mut nrf_wifi_osal_priv,
        nbuf: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " nrf_wifi_osal_nbuf_data_get() - Get a handle to the data in a network buffer.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @nbuf: Pointer to a network buffer.\n\n Gets the pointer to the data area of a network buffer(@nbuf).\n\n Return:\n\t\tPass: Pointer to the data in the network buffer.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_nbuf_data_get(
        opriv: *mut nrf_wifi_osal_priv,
        nbuf: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_nbuf_data_put() - Extend the tail portion of the data\n                                in a network buffer.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @nbuf: Pointer to a network buffer.\n @size: Size in bytes, of the extension.\n\n Increases the data area of a network buffer(@nbuf) by @size bytes at the\n end of the area and returns the pointer to the beginning of\n the data area.\n\n Return:\n\t\tPass: Updated pointer to the data in the network buffer.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_nbuf_data_put(
        opriv: *mut nrf_wifi_osal_priv,
        nbuf: *mut ::core::ffi::c_void,
        size: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_nbuf_data_push() - Extend the head portion of the data\n                                 in a network buffer.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @nbuf: Pointer to a network buffer.\n @size: Size in bytes, of the extension.\n\n Increases the data area of a network buffer(@nbuf) by @size bytes at the\n start of the area and returns the pointer to the beginning of the\n data area.\n\n Return:\n\t\tPass: Updated pointer to the data in the network buffer.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_nbuf_data_push(
        opriv: *mut nrf_wifi_osal_priv,
        nbuf: *mut ::core::ffi::c_void,
        size: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_nbuf_data_pull() - Reduce the head portion of the data\n                                 in a network buffer.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @nbuf: Pointer to a network buffer.\n @size: Size in bytes, of the reduction.\n\n Decreases the data area of a network buffer(@nbuf) by @size bytes at the\n start of the area and returns the pointer to the beginning\n of the data area.\n\n Return:\n\t\tPass: Updated pointer to the data in the network buffer.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_nbuf_data_pull(
        opriv: *mut nrf_wifi_osal_priv,
        nbuf: *mut ::core::ffi::c_void,
        size: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_nbuf_get_priority() - Get the priority of a network buffer.\n\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @nbuf: Pointer to a network buffer.\n\n Gets the priority of a network buffer(@nbuf).\n\n Return: Priority of the network buffer."]
    pub fn nrf_wifi_osal_nbuf_get_priority(
        opriv: *mut nrf_wifi_osal_priv,
        nbuf: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_uchar;
}
extern "C" {
    #[doc = " nrf_wifi_osal_tasklet_alloc() - Allocate a tasklet.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @type: Type of tasklet.\n\n Allocates a tasklet structure and returns a pointer to it.\n\n Return:\n\t\tPass: Pointer to the tasklet instance allocated.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_tasklet_alloc(
        opriv: *mut nrf_wifi_osal_priv,
        type_: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_tasklet_free() - Free a tasklet.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @tasklet: Pointer to a tasklet.\n\n Frees a tasklet structure that had been allocated using\n @nrf_wifi_osal_tasklet_alloc.\n\n Return: None."]
    pub fn nrf_wifi_osal_tasklet_free(
        opriv: *mut nrf_wifi_osal_priv,
        tasklet: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_tasklet_init() - Initialize a tasklet.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @tasklet:  Pointer to a tasklet.\n @callbk_fn: Callback function to be invoked by the tasklet.\n @data: Data to be passed to the callback function when the tasklet\n        invokes it.\n\n Initializes a tasklet structure(@tasklet) that had been allocated using\n @nrf_wifi_osal_tasklet_alloc. Needs to be passed a callback\n function (@callbk_fn) which should get invoked when the tasklet is\n scheduled and the data(@data) which needs to be passed to the\n callback function.\n\n Return: None."]
    pub fn nrf_wifi_osal_tasklet_init(
        opriv: *mut nrf_wifi_osal_priv,
        tasklet: *mut ::core::ffi::c_void,
        callbk_fn: ::core::option::Option<unsafe extern "C" fn(arg1: ::core::ffi::c_ulong)>,
        data: ::core::ffi::c_ulong,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_tasklet_schedule() - Schedule a tasklet.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @tasklet:  Pointer to a tasklet.\n\n Schedules a tasklet that had been allocated using\n @nrf_wifi_osal_tasklet_alloc and initialized using\n @nrf_wifi_osal_tasklet_init.\n\n Return: None."]
    pub fn nrf_wifi_osal_tasklet_schedule(
        opriv: *mut nrf_wifi_osal_priv,
        tasklet: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_tasklet_kill() - Terminate a tasklet.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @tasklet:  Pointer to a tasklet.\n\n Terminates a tasklet(@tasklet) that had been scheduled by\n @nrf_wifi_osal_tasklet_schedule.\n\n Return: None."]
    pub fn nrf_wifi_osal_tasklet_kill(
        opriv: *mut nrf_wifi_osal_priv,
        tasklet: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_sleep_ms() - Sleep for a specified duration in milliseconds.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @msecs: Sleep duration in milliseconds.\n\n Puts the calling thread to sleep for atleast @msecs milliseconds.\n\n Return: None."]
    pub fn nrf_wifi_osal_sleep_ms(opriv: *mut nrf_wifi_osal_priv, msecs: ::core::ffi::c_uint);
}
extern "C" {
    #[doc = " nrf_wifi_osal_delay_us() - Delay for a specified duration in microseconds.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @usecs: Delay duration in microseconds.\n\n Delays execution of calling thread for @usecs microseconds. This is\n busy-waiting and won't allow other threads to execute during\n the time lapse.\n\n Return: None."]
    pub fn nrf_wifi_osal_delay_us(opriv: *mut nrf_wifi_osal_priv, usecs: ::core::ffi::c_ulong);
}
extern "C" {
    #[doc = " nrf_wifi_osal_time_get_curr_us() - Get current system uptime in microseconds.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n\n Gets the current system uptime in microseconds.\n\n Return: System uptime in microseconds."]
    pub fn nrf_wifi_osal_time_get_curr_us(opriv: *mut nrf_wifi_osal_priv) -> ::core::ffi::c_ulong;
}
extern "C" {
    #[doc = " nrf_wifi_osal_time_elapsed_us() - Get elapsed time in microseconds\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @start_time_us: The timestamp in microseconds from which elapsed\n                 time is to be measured.\n\n Returns the time elapsed in microseconds since some\n time instant (@start_time_us).\n\n Return: Elapsed time in microseconds."]
    pub fn nrf_wifi_osal_time_elapsed_us(
        opriv: *mut nrf_wifi_osal_priv,
        start_time_us: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_pcie_init() - Initialize a PCIe driver.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @dev_name: Name of the PCIe device.\n @vendor_id: Vendor ID of the PCIe device.\n @sub_vendor_id: Sub-vendor ID of the PCIE device.\n @device_id: Device ID of the PCIe device.\n @sub_device_id: Sub-device ID of the PCIe device.\n\n Registers a PCIe device driver to the OS's PCIe core.\n\n Return: OS specific PCIe device context."]
    pub fn nrf_wifi_osal_bus_pcie_init(
        opriv: *mut nrf_wifi_osal_priv,
        dev_name: *const ::core::ffi::c_char,
        vendor_id: ::core::ffi::c_uint,
        sub_vendor_id: ::core::ffi::c_uint,
        device_id: ::core::ffi::c_uint,
        sub_device_id: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_pcie_deinit() - Deinitialize a PCIe device driver.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_pcie_priv: OS specific PCIe context.\n\n This API should be called when the PCIe device driver is\n to be unregistered from the OS's PCIe core.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_pcie_deinit(
        opriv: *mut nrf_wifi_osal_priv,
        os_pcie_priv: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_pcie_dev_add() - Add a PCIe device instance.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @osal_pcie_dev_ctx: Pointer to the OSAL PCIe device context.\n\n Function to be invoked when a matching PCIe device is added to the system.\n It expects the pointer to a OS specific PCIe device context to be returned.\n\n Return: OS specific PCIe device context."]
    pub fn nrf_wifi_osal_bus_pcie_dev_add(
        opriv: *mut nrf_wifi_osal_priv,
        os_pcie_priv: *mut ::core::ffi::c_void,
        osal_pcie_dev_ctx: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_pcie_dev_rem() - Remove a PCIe device instance.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_pcie_dev_ctx: Pointer to the OS specific PCIe device context which was\n                   returned by @nrf_wifi_osal_bus_pcie_dev_add.\n\n Function to be invoked when a matching PCIe device is removed from the system.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_pcie_dev_rem(
        opriv: *mut nrf_wifi_osal_priv,
        os_pcie_dev_ctx: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_pcie_dev_init() - Initialize a PCIe device instance.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_pcie_dev_ctx: Pointer to the OS specific PCIe device context which was\n                   returned by @nrf_wifi_osal_bus_pcie_dev_add.\n\n Function to be invoked when a PCIe device is to be initialized.\n\n Return:\n\t\tPass: NRF_WIFI_STATUS_SUCCESS.\n\t\tFail: NRF_WIFI_STATUS_FAIL."]
    pub fn nrf_wifi_osal_bus_pcie_dev_init(
        opriv: *mut nrf_wifi_osal_priv,
        os_pcie_dev_ctx: *mut ::core::ffi::c_void,
    ) -> nrf_wifi_status;
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_pcie_dev_deinit() - Deinitialize a PCIe device instance.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_pcie_dev_ctx: Pointer to the OS specific PCIe device context which was\n                   returned by @nrf_wifi_osal_bus_pcie_dev_add.\n\n Function to be invoked when a PCIe device is to be deinitialized.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_pcie_dev_deinit(
        opriv: *mut nrf_wifi_osal_priv,
        os_pcie_dev_ctx: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_pcie_dev_intr_reg() - Register a interrupt handler for a PCIe device.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_pcie_dev_ctx: OS specific PCIe device context.\n @callbk_data: Data to be passed to the ISR.\n @callbk_fn: ISR to be invoked on receiving an interrupt.\n\n Registers an interrupt handler to the OS. This API also passes the callback\n data to be passed to the ISR when an interrupt is received.\n\n Return:\n\t    Pass: NRF_WIFI_STATUS_SUCCESS.\n\t    Fail: NRF_WIFI_STATUS_FAIL."]
    pub fn nrf_wifi_osal_bus_pcie_dev_intr_reg(
        opriv: *mut nrf_wifi_osal_priv,
        os_pcie_dev_ctx: *mut ::core::ffi::c_void,
        callbk_data: *mut ::core::ffi::c_void,
        callbk_fn: ::core::option::Option<
            unsafe extern "C" fn(callbk_data: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
        >,
    ) -> nrf_wifi_status;
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_pcie_dev_intr_unreg() - Unregister an interrupt handler for a PCIe device.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_pcie_dev_ctx: OS specific PCIe device context.\n\n Unregisters the interrupt handler that was registered using\n @nrf_wifi_osal_bus_pcie_dev_intr_reg.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_pcie_dev_intr_unreg(
        opriv: *mut nrf_wifi_osal_priv,
        os_pcie_dev_ctx: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_pcie_dev_dma_map() - Map host memory for DMA access.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_pcie_dev_ctx: Pointer to a OS specific PCIe device handle.\n @virt_addr: Virtual host address to be DMA mapped.\n @size: Size in bytes of the host memory to be DMA mapped.\n @dir: DMA direction.\n\n Maps host memory of @size bytes pointed to by the virtual address\n @virt_addr to be used by the device(@dma_dev) for DMAing contents.\n The contents are available for DMAing to the device if @dir has a\n value of @NRF_WIFI_OSAL_DMA_DIR_TO_DEV. Conversely the device can DMA\n contents to the host memory if @dir has a value of\n @NRF_WIFI_OSAL_DMA_DIR_FROM_DEV. The function returns the DMA address\n of the mapped memory.\n\n Return:\n\t\tPass: Pointer to the DMA mapped physical address.\n\t\tError: NULL."]
    pub fn nrf_wifi_osal_bus_pcie_dev_dma_map(
        opriv: *mut nrf_wifi_osal_priv,
        os_pcie_dev_ctx: *mut ::core::ffi::c_void,
        virt_addr: *mut ::core::ffi::c_void,
        size: usize,
        dir: nrf_wifi_osal_dma_dir,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_pcie_dev_dma_unmap() - Unmap DMA mapped host memory.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_pcie_dev_ctx: Pointer to a OS specific PCIe device handle.\n @dma_addr: DMA mapped physical host memory address.\n @size: Size in bytes of the DMA mapped host memory.\n @dir: DMA direction.\n\n Unmaps the host memory which was mapped for DMA using @nrf_wifi_osal_dma_map.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_pcie_dev_dma_unmap(
        opriv: *mut nrf_wifi_osal_priv,
        os_pcie_dev_ctx: *mut ::core::ffi::c_void,
        dma_addr: *mut ::core::ffi::c_void,
        size: usize,
        dir: nrf_wifi_osal_dma_dir,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_pcie_dev_host_map_get() - Get host mapped address for a PCIe device.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_pcie_dev_ctx: OS specific PCIe device context.\n @host_map: Host map address information.\n\n Gets the host map address for a PCIe device.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_pcie_dev_host_map_get(
        opriv: *mut nrf_wifi_osal_priv,
        os_pcie_dev_ctx: *mut ::core::ffi::c_void,
        host_map: *mut nrf_wifi_osal_host_map,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_qspi_init() - Initialize a qspi driver.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n\n Registers a qspi device driver to the OS's qspi core.\n\n Return: OS specific qspi device context."]
    pub fn nrf_wifi_osal_bus_qspi_init(opriv: *mut nrf_wifi_osal_priv) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_qspi_deinit() - Deinitialize a qspi device driver.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_qspi_priv: OS specific qspi context.\n\n This API should be called when the qspi device driver is\n to be unregistered from the OS's qspi core.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_qspi_deinit(
        opriv: *mut nrf_wifi_osal_priv,
        os_qspi_priv: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_qspi_dev_add() - Add a qspi device instance.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @osal_qspi_dev_ctx: Pointer to the OSAL qspi device context.\n\n Function to be invoked when a matching qspi device is added to the system.\n It expects the pointer to a OS specific qspi device context to be returned.\n\n Return: OS specific qspi device context."]
    pub fn nrf_wifi_osal_bus_qspi_dev_add(
        opriv: *mut nrf_wifi_osal_priv,
        os_qspi_priv: *mut ::core::ffi::c_void,
        osal_qspi_dev_ctx: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_qspi_dev_rem() - Remove a qspi device instance.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_qspi_dev_ctx: Pointer to the OS specific qspi device context which was\n                   returned by @nrf_wifi_osal_bus_qspi_dev_add.\n\n Function to be invoked when a matching qspi device is removed from the system.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_qspi_dev_rem(
        opriv: *mut nrf_wifi_osal_priv,
        os_qspi_dev_ctx: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_qspi_dev_init() - Initialize a qspi device instance.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_qspi_dev_ctx: Pointer to the OS specific qspi device context which was\n                   returned by @nrf_wifi_osal_bus_qspi_dev_add.\n\n Function to be invoked when a qspi device is to be initialized.\n\n Return:\n\t\tPass: NRF_WIFI_STATUS_SUCCESS.\n\t\tFail: NRF_WIFI_STATUS_FAIL."]
    pub fn nrf_wifi_osal_bus_qspi_dev_init(
        opriv: *mut nrf_wifi_osal_priv,
        os_qspi_dev_ctx: *mut ::core::ffi::c_void,
    ) -> nrf_wifi_status;
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_qspi_dev_deinit() - Deinitialize a qspi device instance.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_qspi_dev_ctx: Pointer to the OS specific qspi device context which was\n                   returned by @nrf_wifi_osal_bus_qspi_dev_add.\n\n Function to be invoked when a qspi device is to be deinitialized.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_qspi_dev_deinit(
        opriv: *mut nrf_wifi_osal_priv,
        os_qspi_dev_ctx: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_qspi_dev_intr_reg() - Register a interrupt handler for a qspi device.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_qspi_dev_ctx: OS specific qspi device context.\n @callbk_data: Data to be passed to the ISR.\n @callbk_fn: ISR to be invoked on receiving an interrupt.\n\n Registers an interrupt handler to the OS. This API also passes the callback\n data to be passed to the ISR when an interrupt is received.\n\n Return:\n\t    Pass: NRF_WIFI_STATUS_SUCCESS.\n\t    Fail: NRF_WIFI_STATUS_FAIL."]
    pub fn nrf_wifi_osal_bus_qspi_dev_intr_reg(
        opriv: *mut nrf_wifi_osal_priv,
        os_qspi_dev_ctx: *mut ::core::ffi::c_void,
        callbk_data: *mut ::core::ffi::c_void,
        callbk_fn: ::core::option::Option<
            unsafe extern "C" fn(callbk_data: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
        >,
    ) -> nrf_wifi_status;
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_qspi_dev_intr_unreg() - Unregister an interrupt handler for a qspi device.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_qspi_dev_ctx: OS specific qspi device context.\n\n Unregisters the interrupt handler that was registered using\n @nrf_wifi_osal_bus_qspi_dev_intr_reg.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_qspi_dev_intr_unreg(
        opriv: *mut nrf_wifi_osal_priv,
        os_qspi_dev_ctx: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_qspi_dev_host_map_get() - Get host mapped address for a qspi device.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_qspi_dev_ctx: OS specific qspi device context.\n @host_map: Host map address information.\n\n Gets the host map address for a qspi device.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_qspi_dev_host_map_get(
        opriv: *mut nrf_wifi_osal_priv,
        os_qspi_dev_ctx: *mut ::core::ffi::c_void,
        host_map: *mut nrf_wifi_osal_host_map,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_qspi_read_reg32() - Read value from a 32 bit register on a\n                                  QSPI slave device.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @priv:\n @addr: Address of the register to read from.\n\n Reads value from a 32 bit device register at address(@addr) on\n a QSPI slave device.\n\n Return: 32 bit value read from register."]
    pub fn nrf_wifi_osal_qspi_read_reg32(
        opriv: *mut nrf_wifi_osal_priv,
        priv_: *mut ::core::ffi::c_void,
        addr: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " nrf_wifi_osal_qspi_write_reg32() -\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @priv:\n @addr: Address of the register to write to.\n @val: Value to be written to the register.\n\n Writes a 32 bit value (@val) to a 32 bit device register at address(@addr)\n on a QSPI slave device.\n\n Return: None."]
    pub fn nrf_wifi_osal_qspi_write_reg32(
        opriv: *mut nrf_wifi_osal_priv,
        priv_: *mut ::core::ffi::c_void,
        addr: ::core::ffi::c_ulong,
        val: ::core::ffi::c_uint,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_qspi_cpy_from() -\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @priv:\n @dest:\n @src:\n @count:\n\n\n Return: None."]
    pub fn nrf_wifi_osal_qspi_cpy_from(
        opriv: *mut nrf_wifi_osal_priv,
        priv_: *mut ::core::ffi::c_void,
        dest: *mut ::core::ffi::c_void,
        addr: ::core::ffi::c_ulong,
        count: usize,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_qspi_cpy_to() -\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @priv:\n @dest:\n @src:\n @count:\n\n\n Return: None."]
    pub fn nrf_wifi_osal_qspi_cpy_to(
        opriv: *mut nrf_wifi_osal_priv,
        priv_: *mut ::core::ffi::c_void,
        addr: ::core::ffi::c_ulong,
        src: *const ::core::ffi::c_void,
        count: usize,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_spi_init() - Initialize a spi driver.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n\n Registers a spi device driver to the OS's spi core.\n\n Return: OS specific spi device context."]
    pub fn nrf_wifi_osal_bus_spi_init(opriv: *mut nrf_wifi_osal_priv) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_spi_deinit() - Deinitialize a spi device driver.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_spi_priv: OS specific spi context.\n\n This API should be called when the spi device driver is\n to be unregistered from the OS's spi core.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_spi_deinit(
        opriv: *mut nrf_wifi_osal_priv,
        os_spi_priv: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_spi_dev_add() - Add a spi device instance.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @osal_spi_dev_ctx: Pointer to the OSAL spi device context.\n\n Function to be invoked when a matching spi device is added to the system.\n It expects the pointer to a OS specific spi device context to be returned.\n\n Return: OS specific spi device context."]
    pub fn nrf_wifi_osal_bus_spi_dev_add(
        opriv: *mut nrf_wifi_osal_priv,
        os_spi_priv: *mut ::core::ffi::c_void,
        osal_spi_dev_ctx: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_spi_dev_rem() - Remove a spi device instance.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_spi_dev_ctx: Pointer to the OS specific spi device context which was\n                   returned by @nrf_wifi_osal_bus_spi_dev_add.\n\n Function to be invoked when a matching spi device is removed from the system.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_spi_dev_rem(
        opriv: *mut nrf_wifi_osal_priv,
        os_spi_dev_ctx: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_spi_dev_init() - Initialize a spi device instance.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_spi_dev_ctx: Pointer to the OS specific spi device context which was\n                   returned by @nrf_wifi_osal_bus_spi_dev_add.\n\n Function to be invoked when a spi device is to be initialized.\n\n Return:\n\t\tPass: nrf_wifi_STATUS_SUCCESS.\n\t\tFail: nrf_wifi_STATUS_FAIL."]
    pub fn nrf_wifi_osal_bus_spi_dev_init(
        opriv: *mut nrf_wifi_osal_priv,
        os_spi_dev_ctx: *mut ::core::ffi::c_void,
    ) -> nrf_wifi_status;
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_spi_dev_deinit() - Deinitialize a spi device instance.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_spi_dev_ctx: Pointer to the OS specific spi device context which was\n                   returned by @nrf_wifi_osal_bus_spi_dev_add.\n\n Function to be invoked when a spi device is to be deinitialized.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_spi_dev_deinit(
        opriv: *mut nrf_wifi_osal_priv,
        os_spi_dev_ctx: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_spi_dev_intr_reg() - Register a interrupt handler for a spi device.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_spi_dev_ctx: OS specific spi device context.\n @callbk_data: Data to be passed to the ISR.\n @callbk_fn: ISR to be invoked on receiving an interrupt.\n\n Registers an interrupt handler to the OS. This API also passes the callback\n data to be passed to the ISR when an interrupt is received.\n\n Return:\n\t    Pass: nrf_wifi_STATUS_SUCCESS.\n\t    Fail: nrf_wifi_STATUS_FAIL."]
    pub fn nrf_wifi_osal_bus_spi_dev_intr_reg(
        opriv: *mut nrf_wifi_osal_priv,
        os_spi_dev_ctx: *mut ::core::ffi::c_void,
        callbk_data: *mut ::core::ffi::c_void,
        callbk_fn: ::core::option::Option<
            unsafe extern "C" fn(callbk_data: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
        >,
    ) -> nrf_wifi_status;
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_spi_dev_intr_unreg() - Unregister an interrupt handler for a spi device.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_spi_dev_ctx: OS specific spi device context.\n\n Unregisters the interrupt handler that was registered using\n @nrf_wifi_osal_bus_spi_dev_intr_reg.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_spi_dev_intr_unreg(
        opriv: *mut nrf_wifi_osal_priv,
        os_spi_dev_ctx: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_bus_spi_dev_host_map_get() - Get host mapped address for a spi device.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @os_spi_dev_ctx: OS specific spi device context.\n @host_map: Host map address information.\n\n Gets the host map address for a spi device.\n\n Return: None."]
    pub fn nrf_wifi_osal_bus_spi_dev_host_map_get(
        opriv: *mut nrf_wifi_osal_priv,
        os_spi_dev_ctx: *mut ::core::ffi::c_void,
        host_map: *mut nrf_wifi_osal_host_map,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_spi_read_reg32() - Read value from a 32 bit register on a\n                                  Linux SPI slave device.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @priv:\n @addr: Address of the register to read from.\n\n Reads value from a 32 bit device register at address(@addr) on\n a QSPI slave device.\n\n Return: 32 bit value read from register."]
    pub fn nrf_wifi_osal_spi_read_reg32(
        opriv: *mut nrf_wifi_osal_priv,
        priv_: *mut ::core::ffi::c_void,
        addr: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " nrf_wifi_osal_spi_write_reg32() -\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @priv:\n @addr: Address of the register to write to.\n @val: Value to be written to the register.\n\n Writes a 32 bit value (@val) to a 32 bit device register at address(@addr)\n on a Linux SPI slave device.\n\n Return: None."]
    pub fn nrf_wifi_osal_spi_write_reg32(
        opriv: *mut nrf_wifi_osal_priv,
        priv_: *mut ::core::ffi::c_void,
        addr: ::core::ffi::c_ulong,
        val: ::core::ffi::c_uint,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_spi_cpy_from() -\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @priv:\n @dest:\n @src:\n @count:\n\n\n Return: None."]
    pub fn nrf_wifi_osal_spi_cpy_from(
        opriv: *mut nrf_wifi_osal_priv,
        priv_: *mut ::core::ffi::c_void,
        dest: *mut ::core::ffi::c_void,
        addr: ::core::ffi::c_ulong,
        count: usize,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_spi_cpy_to() -\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @priv:\n @dest:\n @src:\n @count:\n\n\n Return: None."]
    pub fn nrf_wifi_osal_spi_cpy_to(
        opriv: *mut nrf_wifi_osal_priv,
        priv_: *mut ::core::ffi::c_void,
        addr: ::core::ffi::c_ulong,
        src: *const ::core::ffi::c_void,
        count: usize,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_assert() - Assert a condition with a value.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @test: Variable to be tested.\n @val: Value to be checked for the @test\n @op: type of operation to be done during assertion check.\n @msg: Assertion message.\n\n Compares @test aith @val. If true prints assert message.\n\n Return:\n              None"]
    pub fn nrf_wifi_osal_assert(
        opriv: *mut nrf_wifi_osal_priv,
        test: ::core::ffi::c_int,
        val: ::core::ffi::c_int,
        op: nrf_wifi_assert_op_type,
        msg: *mut ::core::ffi::c_char,
    );
}
extern "C" {
    #[doc = " nrf_wifi_osal_strlen() - Gives the length of the string @str.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @str: Pointer to the memory location of the string.\n\n Calculates the length of the string pointed to by @str\n\n Return:\n              returns the number of bytes of the string @str."]
    pub fn nrf_wifi_osal_strlen(
        opriv: *mut nrf_wifi_osal_priv,
        str_: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " nrf_wifi_osal_mem_cmp() - Compare contents from one memory location to another.\n @opriv: Pointer to the OSAL context returned by the @nrf_wifi_osal_init API.\n @addr1: Pointer to the memory location of first address.\n @addr2: Pointer to the memory location of second address.\n @count: Number of bytes to be compared.\n\n Compares @count number of bytes from @addr1 location in memory to @addr2\n location in memory.\n\n Return:\n              returns an integer less than, equal to, or greater than zero"]
    pub fn nrf_wifi_osal_mem_cmp(
        opriv: *mut nrf_wifi_osal_priv,
        addr1: *const ::core::ffi::c_void,
        addr2: *const ::core::ffi::c_void,
        count: usize,
    ) -> ::core::ffi::c_int;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum RPU_MCU_ADDR_REGIONS {
    RPU_MCU_ADDR_REGION_ROM = 0,
    RPU_MCU_ADDR_REGION_RETENTION = 1,
    RPU_MCU_ADDR_REGION_SCRATCH = 2,
    RPU_MCU_ADDR_REGION_MAX = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_addr_region {
    pub start: ::core::ffi::c_uint,
    pub end: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_rpu_addr_region() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_addr_region> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_addr_region>(),
        8usize,
        concat!("Size of: ", stringify!(rpu_addr_region))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_addr_region>(),
        4usize,
        concat!("Alignment of ", stringify!(rpu_addr_region))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_addr_region),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_addr_region),
            "::",
            stringify!(end)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_addr_map {
    pub regions: [rpu_addr_region; 3usize],
}
#[test]
fn bindgen_test_layout_rpu_addr_map() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_addr_map> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_addr_map>(),
        24usize,
        concat!("Size of: ", stringify!(rpu_addr_map))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_addr_map>(),
        4usize,
        concat!("Alignment of ", stringify!(rpu_addr_map))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).regions) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_addr_map),
            "::",
            stringify!(regions)
        )
    );
}
extern "C" {
    pub static RPU_ADDR_MAP_MCU: [rpu_addr_map; 2usize];
}
#[doc = " struct nrf_wifi_rpu_pwr_data - Data that host may want to read from the Power IP.\n @lfc_err: Estimated Lo Frequency Clock error in ppm.\n @vbat_mon: Vbat monitor readout. The actual Vbat in volt equals 2.5 + 0.07*vbat_mon.\n @temp: Estimated die temperature (degC).\n\n This structure represents the Power IP monitoring data."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_rpu_pwr_data {
    pub lfc_err: ::core::ffi::c_int,
    pub vbat_mon: ::core::ffi::c_int,
    pub temp: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_nrf_wifi_rpu_pwr_data() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_rpu_pwr_data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_rpu_pwr_data>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_rpu_pwr_data))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_rpu_pwr_data>(),
        4usize,
        concat!("Alignment of ", stringify!(nrf_wifi_rpu_pwr_data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lfc_err) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rpu_pwr_data),
            "::",
            stringify!(lfc_err)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vbat_mon) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rpu_pwr_data),
            "::",
            stringify!(vbat_mon)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).temp) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rpu_pwr_data),
            "::",
            stringify!(temp)
        )
    );
}
#[doc = " struct host_rpu_rx_buf_info - RX buffer related information to be passed to\n                               the RPU.\n @addr: Address in the host memory where the RX buffer is located.\n\n This structure encapsulates the information to be passed to the RPU for\n buffers which the RPU will use to pass the received frames."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct host_rpu_rx_buf_info {
    pub addr: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_host_rpu_rx_buf_info() {
    const UNINIT: ::core::mem::MaybeUninit<host_rpu_rx_buf_info> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<host_rpu_rx_buf_info>(),
        4usize,
        concat!("Size of: ", stringify!(host_rpu_rx_buf_info))
    );
    assert_eq!(
        ::core::mem::align_of::<host_rpu_rx_buf_info>(),
        1usize,
        concat!("Alignment of ", stringify!(host_rpu_rx_buf_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_rx_buf_info),
            "::",
            stringify!(addr)
        )
    );
}
#[doc = " struct host_rpu_hpq - Hostport Queue (HPQ) information.\n @enqueue_addr: HPQ address where the host can post the address of a\n                message intended for the RPU.\n @dequeue_addr: HPQ address where the host can get the address of a\n                message intended for the host.\n\n This structure encapsulates the information which represents a HPQ."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct host_rpu_hpq {
    pub enqueue_addr: ::core::ffi::c_uint,
    pub dequeue_addr: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_host_rpu_hpq() {
    const UNINIT: ::core::mem::MaybeUninit<host_rpu_hpq> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<host_rpu_hpq>(),
        8usize,
        concat!("Size of: ", stringify!(host_rpu_hpq))
    );
    assert_eq!(
        ::core::mem::align_of::<host_rpu_hpq>(),
        1usize,
        concat!("Alignment of ", stringify!(host_rpu_hpq))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).enqueue_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_hpq),
            "::",
            stringify!(enqueue_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dequeue_addr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_hpq),
            "::",
            stringify!(dequeue_addr)
        )
    );
}
#[doc = " struct host_rpu_hpqm_info - Information about Hostport Queues (HPQ) to be used\n            for exchanging information between the Host and RPU.\n @event_busy_queue: Queue which the RPU uses to inform the host about events.\n @event_avl_queue: Queue on which the consumed events are pushed so that RPU\n                    can reuse them.\n @cmd_busy_queue: Queue used by the host to push commands to the RPU.\n @cmd_avl_queue: Queue which RPU uses to inform host about command\n                  buffers which can be used to push commands to the RPU.\n\n Hostport queue information passed by the RPU to the host, which the host can\n use, to communicate with the RPU."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct host_rpu_hpqm_info {
    pub event_busy_queue: host_rpu_hpq,
    pub event_avl_queue: host_rpu_hpq,
    pub cmd_busy_queue: host_rpu_hpq,
    pub cmd_avl_queue: host_rpu_hpq,
    pub rx_buf_busy_queue: [host_rpu_hpq; 3usize],
}
#[test]
fn bindgen_test_layout_host_rpu_hpqm_info() {
    const UNINIT: ::core::mem::MaybeUninit<host_rpu_hpqm_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<host_rpu_hpqm_info>(),
        56usize,
        concat!("Size of: ", stringify!(host_rpu_hpqm_info))
    );
    assert_eq!(
        ::core::mem::align_of::<host_rpu_hpqm_info>(),
        1usize,
        concat!("Alignment of ", stringify!(host_rpu_hpqm_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_busy_queue) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_hpqm_info),
            "::",
            stringify!(event_busy_queue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_avl_queue) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_hpqm_info),
            "::",
            stringify!(event_avl_queue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_busy_queue) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_hpqm_info),
            "::",
            stringify!(cmd_busy_queue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_avl_queue) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_hpqm_info),
            "::",
            stringify!(cmd_avl_queue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_buf_busy_queue) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_hpqm_info),
            "::",
            stringify!(rx_buf_busy_queue)
        )
    );
}
#[doc = " struct host_rpu_msg_hdr - Common header included in each command/event.\n @len: Length of the message.\n @resubmit: Flag to indicate whether the recipient is expected to resubmit\n            the cmd/event address back to the trasmitting entity.\n\n This structure encapsulates the common information included at the start of\n each command/event exchanged with the RPU."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct host_rpu_msg_hdr {
    pub len: ::core::ffi::c_uint,
    pub resubmit: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_host_rpu_msg_hdr() {
    const UNINIT: ::core::mem::MaybeUninit<host_rpu_msg_hdr> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<host_rpu_msg_hdr>(),
        8usize,
        concat!("Size of: ", stringify!(host_rpu_msg_hdr))
    );
    assert_eq!(
        ::core::mem::align_of::<host_rpu_msg_hdr>(),
        1usize,
        concat!("Alignment of ", stringify!(host_rpu_msg_hdr))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_msg_hdr),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).resubmit) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_msg_hdr),
            "::",
            stringify!(resubmit)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct pta_ext_params {
    #[doc = " Set polarity to 1 if  BT_TX_RX active high indicates Tx. Set polarity to 0 if BT_TX_RX\n active high indicates Rx."]
    pub tx_rx_pol: ::core::ffi::c_uchar,
    #[doc = " BT_ACTIVE signal lead time period. This is with reference to time instance at which\nBT slot boundary starts if BT supports classic only mode and BT activity starts if BT\nsupports BLE or dual mode"]
    pub lead_time: ::core::ffi::c_uint,
    #[doc = " Time instance at which BT_STATUS is sampled by PTA to get the BT_PTI information. This\nis done anywhere between BT_ACTIVE_ASSERT time and BT_STATUS priority signalling time\nperiod ends.This is with reference to BT_ACTIVE assert time."]
    pub pti_samp_time: ::core::ffi::c_uint,
    #[doc = " Time instance at which BT_STATUS is sampled by PTA to get BT_TX_RX information.\nThis is done by PTA after the end of time period T2.  This is with reference to BT_ACTIVE\nassert time."]
    pub tx_rx_samp_time: ::core::ffi::c_uint,
    #[doc = " Time instance at which PTA takes arbitration decision and posts WLAN_DENY to BT. This\n is with reference to BT_ACTIVE assert time."]
    pub dec_time: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_pta_ext_params() {
    const UNINIT: ::core::mem::MaybeUninit<pta_ext_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pta_ext_params>(),
        17usize,
        concat!("Size of: ", stringify!(pta_ext_params))
    );
    assert_eq!(
        ::core::mem::align_of::<pta_ext_params>(),
        1usize,
        concat!("Alignment of ", stringify!(pta_ext_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_rx_pol) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pta_ext_params),
            "::",
            stringify!(tx_rx_pol)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lead_time) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(pta_ext_params),
            "::",
            stringify!(lead_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pti_samp_time) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(pta_ext_params),
            "::",
            stringify!(pti_samp_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_rx_samp_time) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(pta_ext_params),
            "::",
            stringify!(tx_rx_samp_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dec_time) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(pta_ext_params),
            "::",
            stringify!(dec_time)
        )
    );
}
#[repr(u32)]
#[doc = " @brief This enum defines the different categories of messages that can be exchanged between\n  the Host and the RPU.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_host_rpu_msg_type {
    #[doc = " System interface messages"]
    NRF_WIFI_HOST_RPU_MSG_TYPE_SYSTEM = 0,
    #[doc = " Unused"]
    NRF_WIFI_HOST_RPU_MSG_TYPE_SUPPLICANT = 1,
    #[doc = " Data path messages"]
    NRF_WIFI_HOST_RPU_MSG_TYPE_DATA = 2,
    #[doc = " Control path messages"]
    NRF_WIFI_HOST_RPU_MSG_TYPE_UMAC = 3,
}
#[doc = " @brief This structure defines the common message header used to encapsulate each message\n  exchanged between the Host and UMAC.\n"]
#[repr(C, packed)]
pub struct host_rpu_msg {
    #[doc = " Header"]
    pub hdr: host_rpu_msg_hdr,
    #[doc = " Type of the RPU message see &enum nrf_wifi_host_rpu_msg_type"]
    pub type_: ::core::ffi::c_int,
    #[doc = " Actual message"]
    pub msg: __IncompleteArrayField<::core::ffi::c_schar>,
}
#[test]
fn bindgen_test_layout_host_rpu_msg() {
    const UNINIT: ::core::mem::MaybeUninit<host_rpu_msg> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<host_rpu_msg>(),
        12usize,
        concat!("Size of: ", stringify!(host_rpu_msg))
    );
    assert_eq!(
        ::core::mem::align_of::<host_rpu_msg>(),
        1usize,
        concat!("Alignment of ", stringify!(host_rpu_msg))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_msg),
            "::",
            stringify!(hdr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_msg),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).msg) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_msg),
            "::",
            stringify!(msg)
        )
    );
}
#[doc = " @brief This structure represents the bitmap of STA (Station) pending frames in\n  SoftAP power save mode.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sap_pend_frames_bitmap {
    #[doc = " STA MAC address"]
    pub mac_addr: [::core::ffi::c_uchar; 6usize],
    #[doc = " Pending frames bitmap for each access category"]
    pub pend_frames_bitmap: ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_sap_pend_frames_bitmap() {
    const UNINIT: ::core::mem::MaybeUninit<sap_pend_frames_bitmap> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sap_pend_frames_bitmap>(),
        7usize,
        concat!("Size of: ", stringify!(sap_pend_frames_bitmap))
    );
    assert_eq!(
        ::core::mem::align_of::<sap_pend_frames_bitmap>(),
        1usize,
        concat!("Alignment of ", stringify!(sap_pend_frames_bitmap))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sap_pend_frames_bitmap),
            "::",
            stringify!(mac_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pend_frames_bitmap) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(sap_pend_frames_bitmap),
            "::",
            stringify!(pend_frames_bitmap)
        )
    );
}
#[doc = " @brief This structure represents the information related to UMAC.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct host_rpu_umac_info {
    #[doc = " Boot status signature"]
    pub boot_status: ::core::ffi::c_uint,
    #[doc = " UMAC version"]
    pub version: ::core::ffi::c_uint,
    #[doc = " @ref sap_pend_frames_bitmap"]
    pub sap_bitmap: [sap_pend_frames_bitmap; 4usize],
    #[doc = " Hardware queues info &enum host_rpu_hpqm_info"]
    pub hpqm_info: host_rpu_hpqm_info,
    #[doc = " OTP params"]
    pub info_part: ::core::ffi::c_uint,
    #[doc = " OTP params"]
    pub info_variant: ::core::ffi::c_uint,
    #[doc = " OTP params"]
    pub info_lromversion: ::core::ffi::c_uint,
    #[doc = " OTP params"]
    pub info_uromversion: ::core::ffi::c_uint,
    #[doc = " OTP params"]
    pub info_uuid: [::core::ffi::c_uint; 4usize],
    #[doc = " OTP params"]
    pub info_spare0: ::core::ffi::c_uint,
    #[doc = " OTP params"]
    pub info_spare1: ::core::ffi::c_uint,
    #[doc = " OTP params"]
    pub mac_address0: [::core::ffi::c_uint; 2usize],
    #[doc = " OTP params"]
    pub mac_address1: [::core::ffi::c_uint; 2usize],
    #[doc = " OTP params"]
    pub calib: [::core::ffi::c_uint; 9usize],
}
#[test]
fn bindgen_test_layout_host_rpu_umac_info() {
    const UNINIT: ::core::mem::MaybeUninit<host_rpu_umac_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<host_rpu_umac_info>(),
        184usize,
        concat!("Size of: ", stringify!(host_rpu_umac_info))
    );
    assert_eq!(
        ::core::mem::align_of::<host_rpu_umac_info>(),
        1usize,
        concat!("Alignment of ", stringify!(host_rpu_umac_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).boot_status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(boot_status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sap_bitmap) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(sap_bitmap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hpqm_info) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(hpqm_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info_part) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(info_part)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info_variant) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(info_variant)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info_lromversion) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(info_lromversion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info_uromversion) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(info_uromversion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info_uuid) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(info_uuid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info_spare0) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(info_spare0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info_spare1) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(info_spare1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac_address0) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(mac_address0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac_address1) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(mac_address1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).calib) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(calib)
        )
    );
}
#[doc = " @brief This structure defines the parameters used to control the max transmit (TX) power\n in both frequency bands for different data rates.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_tx_pwr_ceil_params {
    #[doc = " Maximum power permitted while transmitting DSSS rates in 2.4G band.\n  Resolution is 0.25dBm."]
    pub max_pwr_2g_dsss: ::core::ffi::c_uchar,
    #[doc = " Maximum power permitted while transmitting MCS0 rate in 2.4G band.\n  Resolution is 0.25dBm."]
    pub max_pwr_2g_mcs0: ::core::ffi::c_uchar,
    #[doc = " Maximum power permitted while transmitting MCS7 rate in 2.4G band.\n  Resolution is 0.25dBm."]
    pub max_pwr_2g_mcs7: ::core::ffi::c_uchar,
    #[doc = " Maximum power permitted while transmitting MCS0 rate in 5G lowband.\n Low band corresponds to ch: 36 to 64 Resolution is 0.25dBm."]
    pub max_pwr_5g_low_mcs0: ::core::ffi::c_uchar,
    #[doc = " Maximum power permitted while transmitting MCS7 rate in 5G lowband.\n Low band corresponds to ch: 36 to 64, resolution is 0.25dBm."]
    pub max_pwr_5g_low_mcs7: ::core::ffi::c_uchar,
    #[doc = " Maximum power permitted while transmitting MCS0 rate in 5G midband.\n Mid band corresponds to ch: 96 to 132, resolution is 0.25dBm."]
    pub max_pwr_5g_mid_mcs0: ::core::ffi::c_uchar,
    #[doc = " Maximum power permitted while transmitting MCS7 rate in 5G midband.\n Mid band corresponds to ch: 96 to 132, resolution is 0.25dBm."]
    pub max_pwr_5g_mid_mcs7: ::core::ffi::c_uchar,
    #[doc = " Maximum power permitted while transmitting MCS0 rate in 5G highband.\n High band corresponds to ch: 136 to 177, resolution is 0.25dBm."]
    pub max_pwr_5g_high_mcs0: ::core::ffi::c_uchar,
    #[doc = " Maximum power permitted while transmitting MCS7 rate in 5G highband.\n High band corresponds to ch: 136 to 177, resolution is 0.25dBm."]
    pub max_pwr_5g_high_mcs7: ::core::ffi::c_uchar,
    #[doc = " Flag to determine presence of overriding, default parameters present\n in RF parameters string."]
    pub rf_tx_pwr_ceil_params_override: ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_nrf_wifi_tx_pwr_ceil_params() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_tx_pwr_ceil_params> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_tx_pwr_ceil_params>(),
        10usize,
        concat!("Size of: ", stringify!(nrf_wifi_tx_pwr_ceil_params))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_tx_pwr_ceil_params>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_tx_pwr_ceil_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_pwr_2g_dsss) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ceil_params),
            "::",
            stringify!(max_pwr_2g_dsss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_pwr_2g_mcs0) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ceil_params),
            "::",
            stringify!(max_pwr_2g_mcs0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_pwr_2g_mcs7) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ceil_params),
            "::",
            stringify!(max_pwr_2g_mcs7)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_pwr_5g_low_mcs0) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ceil_params),
            "::",
            stringify!(max_pwr_5g_low_mcs0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_pwr_5g_low_mcs7) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ceil_params),
            "::",
            stringify!(max_pwr_5g_low_mcs7)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_pwr_5g_mid_mcs0) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ceil_params),
            "::",
            stringify!(max_pwr_5g_mid_mcs0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_pwr_5g_mid_mcs7) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ceil_params),
            "::",
            stringify!(max_pwr_5g_mid_mcs7)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_pwr_5g_high_mcs0) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ceil_params),
            "::",
            stringify!(max_pwr_5g_high_mcs0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_pwr_5g_high_mcs7) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ceil_params),
            "::",
            stringify!(max_pwr_5g_high_mcs7)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).rf_tx_pwr_ceil_params_override) as usize - ptr as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ceil_params),
            "::",
            stringify!(rf_tx_pwr_ceil_params_override)
        )
    );
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ft_prog_ver {
    FT_PROG_VER1 = 1,
    FT_PROG_VER2 = 2,
    FT_PROG_VER3 = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lmac_prod_stats {
    pub reset_cmd_cnt: ::core::ffi::c_uint,
    pub reset_complete_event_cnt: ::core::ffi::c_uint,
    pub unable_gen_event: ::core::ffi::c_uint,
    pub ch_prog_cmd_cnt: ::core::ffi::c_uint,
    pub channel_prog_done: ::core::ffi::c_uint,
    pub tx_pkt_cnt: ::core::ffi::c_uint,
    pub tx_pkt_done_cnt: ::core::ffi::c_uint,
    pub scan_pkt_cnt: ::core::ffi::c_uint,
    pub internal_pkt_cnt: ::core::ffi::c_uint,
    pub internal_pkt_done_cnt: ::core::ffi::c_uint,
    pub ack_resp_cnt: ::core::ffi::c_uint,
    pub tx_timeout: ::core::ffi::c_uint,
    pub deagg_isr: ::core::ffi::c_uint,
    pub deagg_inptr_desc_empty: ::core::ffi::c_uint,
    pub deagg_circular_buffer_full: ::core::ffi::c_uint,
    pub lmac_rxisr_cnt: ::core::ffi::c_uint,
    pub rx_decryptcnt: ::core::ffi::c_uint,
    pub process_decrypt_fail: ::core::ffi::c_uint,
    pub prepa_rx_event_fail: ::core::ffi::c_uint,
    pub rx_core_pool_full_cnt: ::core::ffi::c_uint,
    pub rx_mpdu_crc_success_cnt: ::core::ffi::c_uint,
    pub rx_mpdu_crc_fail_cnt: ::core::ffi::c_uint,
    pub rx_ofdm_crc_success_cnt: ::core::ffi::c_uint,
    pub rx_ofdm_crc_fail_cnt: ::core::ffi::c_uint,
    pub rxDSSSCrcSuccessCnt: ::core::ffi::c_uint,
    pub rxDSSSCrcFailCnt: ::core::ffi::c_uint,
    pub rx_crypto_start_cnt: ::core::ffi::c_uint,
    pub rx_crypto_done_cnt: ::core::ffi::c_uint,
    pub rx_event_buf_full: ::core::ffi::c_uint,
    pub rx_extram_buf_full: ::core::ffi::c_uint,
    pub scan_req: ::core::ffi::c_uint,
    pub scan_complete: ::core::ffi::c_uint,
    pub scan_abort_req: ::core::ffi::c_uint,
    pub scan_abort_complete: ::core::ffi::c_uint,
    pub internal_buf_pool_null: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_lmac_prod_stats() {
    const UNINIT: ::core::mem::MaybeUninit<lmac_prod_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lmac_prod_stats>(),
        140usize,
        concat!("Size of: ", stringify!(lmac_prod_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<lmac_prod_stats>(),
        4usize,
        concat!("Alignment of ", stringify!(lmac_prod_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reset_cmd_cnt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(reset_cmd_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reset_complete_event_cnt) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(reset_complete_event_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unable_gen_event) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(unable_gen_event)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ch_prog_cmd_cnt) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(ch_prog_cmd_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channel_prog_done) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(channel_prog_done)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_cnt) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(tx_pkt_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_done_cnt) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(tx_pkt_done_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_pkt_cnt) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(scan_pkt_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).internal_pkt_cnt) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(internal_pkt_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).internal_pkt_done_cnt) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(internal_pkt_done_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ack_resp_cnt) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(ack_resp_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_timeout) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(tx_timeout)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deagg_isr) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(deagg_isr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deagg_inptr_desc_empty) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(deagg_inptr_desc_empty)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deagg_circular_buffer_full) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(deagg_circular_buffer_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac_rxisr_cnt) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(lmac_rxisr_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_decryptcnt) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_decryptcnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).process_decrypt_fail) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(process_decrypt_fail)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prepa_rx_event_fail) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(prepa_rx_event_fail)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_core_pool_full_cnt) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_core_pool_full_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_mpdu_crc_success_cnt) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_mpdu_crc_success_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_mpdu_crc_fail_cnt) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_mpdu_crc_fail_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_ofdm_crc_success_cnt) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_ofdm_crc_success_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_ofdm_crc_fail_cnt) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_ofdm_crc_fail_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rxDSSSCrcSuccessCnt) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rxDSSSCrcSuccessCnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rxDSSSCrcFailCnt) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rxDSSSCrcFailCnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_crypto_start_cnt) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_crypto_start_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_crypto_done_cnt) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_crypto_done_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_event_buf_full) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_event_buf_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_extram_buf_full) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_extram_buf_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_req) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(scan_req)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_complete) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(scan_complete)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_abort_req) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(scan_abort_req)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_abort_complete) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(scan_abort_complete)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).internal_buf_pool_null) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(internal_buf_pool_null)
        )
    );
}
#[doc = " struct phy_prod_stats : used to get the production mode stats"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct phy_prod_stats {
    pub ofdm_crc32_pass_cnt: ::core::ffi::c_uint,
    pub ofdm_crc32_fail_cnt: ::core::ffi::c_uint,
    pub dsss_crc32_pass_cnt: ::core::ffi::c_uint,
    pub dsss_crc32_fail_cnt: ::core::ffi::c_uint,
    pub averageRSSI: ::core::ffi::c_char,
}
#[test]
fn bindgen_test_layout_phy_prod_stats() {
    const UNINIT: ::core::mem::MaybeUninit<phy_prod_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<phy_prod_stats>(),
        20usize,
        concat!("Size of: ", stringify!(phy_prod_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<phy_prod_stats>(),
        4usize,
        concat!("Alignment of ", stringify!(phy_prod_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ofdm_crc32_pass_cnt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(phy_prod_stats),
            "::",
            stringify!(ofdm_crc32_pass_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ofdm_crc32_fail_cnt) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(phy_prod_stats),
            "::",
            stringify!(ofdm_crc32_fail_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dsss_crc32_pass_cnt) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(phy_prod_stats),
            "::",
            stringify!(dsss_crc32_pass_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dsss_crc32_fail_cnt) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(phy_prod_stats),
            "::",
            stringify!(dsss_crc32_fail_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).averageRSSI) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(phy_prod_stats),
            "::",
            stringify!(averageRSSI)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union rpu_stats {
    pub lmac_stats: lmac_prod_stats,
    pub phy_stats: phy_prod_stats,
}
#[test]
fn bindgen_test_layout_rpu_stats() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_stats>(),
        140usize,
        concat!("Size of: ", stringify!(rpu_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_stats>(),
        4usize,
        concat!("Alignment of ", stringify!(rpu_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac_stats) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_stats),
            "::",
            stringify!(lmac_stats)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_stats) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_stats),
            "::",
            stringify!(phy_stats)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct hpqm_queue {
    pub pop_addr: ::core::ffi::c_uint,
    pub push_addr: ::core::ffi::c_uint,
    pub id_num: ::core::ffi::c_uint,
    pub status_addr: ::core::ffi::c_uint,
    pub status_mask: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_hpqm_queue() {
    const UNINIT: ::core::mem::MaybeUninit<hpqm_queue> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<hpqm_queue>(),
        20usize,
        concat!("Size of: ", stringify!(hpqm_queue))
    );
    assert_eq!(
        ::core::mem::align_of::<hpqm_queue>(),
        1usize,
        concat!("Alignment of ", stringify!(hpqm_queue))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pop_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hpqm_queue),
            "::",
            stringify!(pop_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).push_addr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(hpqm_queue),
            "::",
            stringify!(push_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).id_num) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(hpqm_queue),
            "::",
            stringify!(id_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status_addr) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(hpqm_queue),
            "::",
            stringify!(status_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status_mask) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(hpqm_queue),
            "::",
            stringify!(status_mask)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct INT_HPQ {
    pub id: ::core::ffi::c_uint,
    pub head: ::core::ffi::c_uint,
    pub tail: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_INT_HPQ() {
    const UNINIT: ::core::mem::MaybeUninit<INT_HPQ> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<INT_HPQ>(),
        12usize,
        concat!("Size of: ", stringify!(INT_HPQ))
    );
    assert_eq!(
        ::core::mem::align_of::<INT_HPQ>(),
        1usize,
        concat!("Alignment of ", stringify!(INT_HPQ))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(INT_HPQ),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).head) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(INT_HPQ),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tail) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(INT_HPQ),
            "::",
            stringify!(tail)
        )
    );
}
#[doc = " @brief LMAC firmware config params\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct lmac_fw_config_params {
    #[doc = " lmac firmware boot status. LMAC will set to 0x5a5a5a5a after completing boot process"]
    pub boot_status: ::core::ffi::c_uint,
    #[doc = " LMAC version"]
    pub version: ::core::ffi::c_uint,
    #[doc = " Address to resubmit Rx buffers"]
    pub lmac_rx_buffer_addr: ::core::ffi::c_uint,
    #[doc = " Maximum Rx descriptors"]
    pub lmac_rx_max_desc_cnt: ::core::ffi::c_uint,
    #[doc = " size of each descriptor size"]
    pub lmac_rx_desc_size: ::core::ffi::c_uint,
    #[doc = " rpu config name. this is a string"]
    pub rpu_config_name: [::core::ffi::c_uchar; 16usize],
    #[doc = " rpu config number"]
    pub rpu_config_number: [::core::ffi::c_uchar; 8usize],
    #[doc = " numRX"]
    pub numRX: ::core::ffi::c_uint,
    #[doc = " numTX"]
    pub numTX: ::core::ffi::c_uint,
    #[doc = " supported bands"]
    pub bands: ::core::ffi::c_uint,
    #[doc = " system frequency"]
    pub sys_frequency_in_mhz: ::core::ffi::c_uint,
    #[doc = " queue which contains Free GRAM pointers for commands"]
    pub FreeCmdPtrQ: hpqm_queue,
    #[doc = " Command pointer queue. Host should pick pointer from FreeCmdPtrQ, populate\n  command into that address and submit back to this queue for RPU"]
    pub cmdPtrQ: hpqm_queue,
    #[doc = " queue which contains Free GRAM pointers for events"]
    pub eventPtrQ: hpqm_queue,
    #[doc = " Event pointer queue. Host should pick pointer from FreeCmdPtrQ, populate\n  command into that address and submit back to this queue for RPU"]
    pub freeEventPtrQ: hpqm_queue,
    #[doc = " Rx buffer queue"]
    pub SKBGramPtrQ_1: hpqm_queue,
    #[doc = " Rx buffer queue"]
    pub SKBGramPtrQ_2: hpqm_queue,
    #[doc = " Rx buffer queue"]
    pub SKBGramPtrQ_3: hpqm_queue,
    #[doc = " lmac register address to enable ISR to Host"]
    pub HP_lmac_to_host_isr_en: ::core::ffi::c_uint,
    #[doc = " Address to Clear host ISR"]
    pub HP_lmac_to_host_isr_clear: ::core::ffi::c_uint,
    #[doc = " Address to set ISR to lmac Clear host ISR"]
    pub HP_set_lmac_isr: ::core::ffi::c_uint,
    #[doc = " Hardware queues"]
    pub hpq32: [INT_HPQ; 4usize],
}
#[test]
fn bindgen_test_layout_lmac_fw_config_params() {
    const UNINIT: ::core::mem::MaybeUninit<lmac_fw_config_params> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lmac_fw_config_params>(),
        260usize,
        concat!("Size of: ", stringify!(lmac_fw_config_params))
    );
    assert_eq!(
        ::core::mem::align_of::<lmac_fw_config_params>(),
        1usize,
        concat!("Alignment of ", stringify!(lmac_fw_config_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).boot_status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(boot_status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac_rx_buffer_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(lmac_rx_buffer_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac_rx_max_desc_cnt) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(lmac_rx_max_desc_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac_rx_desc_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(lmac_rx_desc_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rpu_config_name) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(rpu_config_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rpu_config_number) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(rpu_config_number)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).numRX) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(numRX)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).numTX) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(numTX)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bands) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(bands)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_frequency_in_mhz) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(sys_frequency_in_mhz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FreeCmdPtrQ) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(FreeCmdPtrQ)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmdPtrQ) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(cmdPtrQ)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).eventPtrQ) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(eventPtrQ)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).freeEventPtrQ) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(freeEventPtrQ)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SKBGramPtrQ_1) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(SKBGramPtrQ_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SKBGramPtrQ_2) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(SKBGramPtrQ_2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SKBGramPtrQ_3) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(SKBGramPtrQ_3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HP_lmac_to_host_isr_en) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(HP_lmac_to_host_isr_en)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HP_lmac_to_host_isr_clear) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(HP_lmac_to_host_isr_clear)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HP_set_lmac_isr) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(HP_set_lmac_isr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hpq32) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(hpq32)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct rx_buf_pool_params {
    #[doc = " buffer size"]
    pub buf_sz: ::core::ffi::c_ushort,
    #[doc = " number of buffers"]
    pub num_bufs: ::core::ffi::c_ushort,
}
#[test]
fn bindgen_test_layout_rx_buf_pool_params() {
    const UNINIT: ::core::mem::MaybeUninit<rx_buf_pool_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rx_buf_pool_params>(),
        4usize,
        concat!("Size of: ", stringify!(rx_buf_pool_params))
    );
    assert_eq!(
        ::core::mem::align_of::<rx_buf_pool_params>(),
        1usize,
        concat!("Alignment of ", stringify!(rx_buf_pool_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buf_sz) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rx_buf_pool_params),
            "::",
            stringify!(buf_sz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_bufs) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rx_buf_pool_params),
            "::",
            stringify!(num_bufs)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct temp_vbat_config {
    pub temp_based_calib_en: ::core::ffi::c_uint,
    pub temp_calib_bitmap: ::core::ffi::c_uint,
    pub vbat_calibp_bitmap: ::core::ffi::c_uint,
    pub temp_vbat_mon_period: ::core::ffi::c_uint,
    pub vth_very_low: ::core::ffi::c_int,
    pub vth_low: ::core::ffi::c_int,
    pub vth_hi: ::core::ffi::c_int,
    pub temp_threshold: ::core::ffi::c_int,
    pub vbat_threshold: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_temp_vbat_config() {
    const UNINIT: ::core::mem::MaybeUninit<temp_vbat_config> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<temp_vbat_config>(),
        36usize,
        concat!("Size of: ", stringify!(temp_vbat_config))
    );
    assert_eq!(
        ::core::mem::align_of::<temp_vbat_config>(),
        1usize,
        concat!("Alignment of ", stringify!(temp_vbat_config))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).temp_based_calib_en) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(temp_based_calib_en)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).temp_calib_bitmap) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(temp_calib_bitmap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vbat_calibp_bitmap) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(vbat_calibp_bitmap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).temp_vbat_mon_period) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(temp_vbat_mon_period)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vth_very_low) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(vth_very_low)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vth_low) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(vth_low)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vth_hi) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(vth_hi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).temp_threshold) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(temp_threshold)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vbat_threshold) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(vbat_threshold)
        )
    );
}
#[repr(u32)]
#[doc = " @brief This enum provides a list of different operating modes.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rpu_op_mode {
    #[doc = " Radio test mode is used for performing radio tests using\n  continuous Tx/Rx on a configured channel at a particular rate or power."]
    RPU_OP_MODE_RADIO_TEST = 0,
    #[doc = " In this mode different types of calibration like RF calibration can be performed"]
    RPU_OP_MODE_FCM = 1,
    #[doc = " Regular mode of operation"]
    RPU_OP_MODE_REG = 2,
    #[doc = " Debug mode can be used to control certain parameters like TX rate\n  in order to debug functional issues."]
    RPU_OP_MODE_DBG = 3,
    #[doc = " Highest mode number currently defined"]
    RPU_OP_MODE_MAX = 4,
}
#[repr(u32)]
#[doc = "  @brief This enum defines various types of statistics."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rpu_stats_type {
    #[doc = " All statistics includes PHY, LMAC & UMAC"]
    RPU_STATS_TYPE_ALL = 0,
    #[doc = " Host statistics"]
    RPU_STATS_TYPE_HOST = 1,
    #[doc = " UMAC statistics"]
    RPU_STATS_TYPE_UMAC = 2,
    #[doc = " LMAC statistics"]
    RPU_STATS_TYPE_LMAC = 3,
    #[doc = " PHY statistics"]
    RPU_STATS_TYPE_PHY = 4,
    #[doc = " Highest statistics type number currently defined"]
    RPU_STATS_TYPE_MAX = 5,
}
#[repr(u32)]
#[doc = " @brief- Throughput mode\n Throughput mode to be used for transmitting the packet."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rpu_tput_mode {
    #[doc = " Legacy mode"]
    RPU_TPUT_MODE_LEGACY = 0,
    #[doc = " High Throuput mode(11n)"]
    RPU_TPUT_MODE_HT = 1,
    #[doc = " Very hight throughput(11ac)"]
    RPU_TPUT_MODE_VHT = 2,
    #[doc = " HE SU mode"]
    RPU_TPUT_MODE_HE_SU = 3,
    #[doc = " HE ER SU mode"]
    RPU_TPUT_MODE_HE_ER_SU = 4,
    #[doc = " HE TB mode"]
    RPU_TPUT_MODE_HE_TB = 5,
    #[doc = " Highest throughput mode currently defined"]
    RPU_TPUT_MODE_MAX = 6,
}
#[repr(u32)]
#[doc = " @brief - System commands.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_sys_commands {
    #[doc = " Command to initialize RPU and RPU responds with NRF_WIFI_EVENT_INIT_DONE"]
    NRF_WIFI_CMD_INIT = 0,
    #[doc = " command to send a Tx packet in radiotest mode"]
    NRF_WIFI_CMD_TX = 1,
    #[doc = " Unused"]
    NRF_WIFI_CMD_IF_TYPE = 2,
    #[doc = " command to specify mode of operation"]
    NRF_WIFI_CMD_MODE = 3,
    #[doc = " command to get statistics"]
    NRF_WIFI_CMD_GET_STATS = 4,
    #[doc = " command to clear statistics"]
    NRF_WIFI_CMD_CLEAR_STATS = 5,
    #[doc = " command to ENABLE/DISABLE receiving packets in radiotest mode"]
    NRF_WIFI_CMD_RX = 6,
    #[doc = " Command to measure battery voltage and RPU responds\twith NRF_WIFI_EVENT_PWR_DATA"]
    NRF_WIFI_CMD_PWR = 7,
    #[doc = " RPU De-initialization"]
    NRF_WIFI_CMD_DEINIT = 8,
    #[doc = " Command for WIFI & Bluetooth coexistence"]
    NRF_WIFI_CMD_BTCOEX = 9,
    #[doc = " Command to start RF test"]
    NRF_WIFI_CMD_RF_TEST = 10,
    #[doc = " Configure HE_GI & HE_LTF"]
    NRF_WIFI_CMD_HE_GI_LTF_CONFIG = 11,
    #[doc = " Command for getting UMAC memory statistics"]
    NRF_WIFI_CMD_UMAC_INT_STATS = 12,
    #[doc = " Command for Setting the channel & Rf params in radiotest mode"]
    NRF_WIFI_CMD_RADIO_TEST_INIT = 13,
    #[doc = " Command for setting country in radiotest mode"]
    NRF_WIFI_CMD_RT_REQ_SET_REG = 14,
    #[doc = " Command to enable/disable fixed data rate in regular mode"]
    NRF_WIFI_CMD_TX_FIX_DATA_RATE = 15,
}
#[repr(u32)]
#[doc = " @brief - Events from the RPU.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_sys_events {
    #[doc = " Response to NRF_WIFI_CMD_PWR"]
    NRF_WIFI_EVENT_PWR_DATA = 0,
    #[doc = " Response to NRF_WIFI_CMD_INIT"]
    NRF_WIFI_EVENT_INIT_DONE = 1,
    #[doc = " Response to NRF_WIFI_CMD_GET_STATS"]
    NRF_WIFI_EVENT_STATS = 2,
    #[doc = " Response to NRF_WIFI_CMD_DEINIT"]
    NRF_WIFI_EVENT_DEINIT_DONE = 3,
    #[doc = " Response to NRF_WIFI_CMD_RF_TEST"]
    NRF_WIFI_EVENT_RF_TEST = 4,
    #[doc = " Response to NRF_WIFI_CMD_BTCOEX."]
    NRF_WIFI_EVENT_COEX_CONFIG = 5,
    #[doc = " Response to NRF_WIFI_CMD_UMAC_INT_STATS"]
    NRF_WIFI_EVENT_INT_UMAC_STATS = 6,
    #[doc = " Command status events for radio test commands"]
    NRF_WIFI_EVENT_RADIOCMD_STATUS = 7,
}
#[repr(u32)]
#[doc = " @brief - Channel Bandwidth types.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rpu_ch_bw {
    #[doc = " 20MHz bandwidth"]
    RPU_CH_BW_20 = 0,
    #[doc = " 40MHz bandwidth"]
    RPU_CH_BW_40 = 1,
    #[doc = " 80MHz bandwidth"]
    RPU_CH_BW_MAX = 2,
}
#[doc = " @brief - This structure specifies the parameters required to configure a specific channel.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct chan_params {
    #[doc = " Primary channel number"]
    pub primary_num: ::core::ffi::c_uint,
    #[doc = " Channel bandwidth"]
    pub bw: ::core::ffi::c_uchar,
    #[doc = " 20Mhz offset value"]
    pub sec_20_offset: ::core::ffi::c_int,
    #[doc = " 40Mhz offset value"]
    pub sec_40_offset: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_chan_params() {
    const UNINIT: ::core::mem::MaybeUninit<chan_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<chan_params>(),
        13usize,
        concat!("Size of: ", stringify!(chan_params))
    );
    assert_eq!(
        ::core::mem::align_of::<chan_params>(),
        1usize,
        concat!("Alignment of ", stringify!(chan_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).primary_num) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(chan_params),
            "::",
            stringify!(primary_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bw) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(chan_params),
            "::",
            stringify!(bw)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sec_20_offset) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(chan_params),
            "::",
            stringify!(sec_20_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sec_40_offset) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(chan_params),
            "::",
            stringify!(sec_40_offset)
        )
    );
}
#[doc = " @brief This structure specifies the parameters required to start or stop the RX (receive)\n  operation in radiotest mode.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_conf_rx_radio_test_params {
    #[doc = " Number of spatial streams supported. Currently unused."]
    pub nss: ::core::ffi::c_uchar,
    pub rf_params: [::core::ffi::c_uchar; 200usize],
    #[doc = " An array containing RF and baseband control params"]
    pub chan: chan_params,
    #[doc = " Copy OTP params to this memory"]
    pub phy_threshold: ::core::ffi::c_schar,
    #[doc = " Calibration bit map value. More information can be found in the phy_rf_params.h file."]
    pub phy_calib: ::core::ffi::c_uint,
    #[doc = " Start Rx : 1, Stop Rx :0"]
    pub rx: ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_rpu_conf_rx_radio_test_params() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_conf_rx_radio_test_params> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_conf_rx_radio_test_params>(),
        220usize,
        concat!("Size of: ", stringify!(rpu_conf_rx_radio_test_params))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_conf_rx_radio_test_params>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_conf_rx_radio_test_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nss) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_rx_radio_test_params),
            "::",
            stringify!(nss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rf_params) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_rx_radio_test_params),
            "::",
            stringify!(rf_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).chan) as usize - ptr as usize },
        201usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_rx_radio_test_params),
            "::",
            stringify!(chan)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_threshold) as usize - ptr as usize },
        214usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_rx_radio_test_params),
            "::",
            stringify!(phy_threshold)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_calib) as usize - ptr as usize },
        215usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_rx_radio_test_params),
            "::",
            stringify!(phy_calib)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx) as usize - ptr as usize },
        219usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_rx_radio_test_params),
            "::",
            stringify!(rx)
        )
    );
}
#[doc = " @brief This structure specifies the UMAC (Upper MAC) RX (receive) debug parameters\n  specifically designed for debugging purpose.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct umac_rx_dbg_params {
    #[doc = " Total lmac events received to UMAC"]
    pub lmac_events: ::core::ffi::c_uint,
    #[doc = " Total Rx events(LMAC_EVENT_RX) received in ISR"]
    pub rx_events: ::core::ffi::c_uint,
    #[doc = " Received coalised events from LMAC"]
    pub rx_coalesce_events: ::core::ffi::c_uint,
    #[doc = " Total Rx packets received from LMAC"]
    pub total_rx_pkts_from_lmac: ::core::ffi::c_uint,
    #[doc = " Maximum RX packets buffered at any point of time in UMAC."]
    pub max_refill_gap: ::core::ffi::c_uint,
    #[doc = " Difference between rx packets received from lmac and packets sent to host"]
    pub current_refill_gap: ::core::ffi::c_uint,
    #[doc = " Number of Packets queued to reorder buffer due to out of order"]
    pub out_of_order_mpdus: ::core::ffi::c_uint,
    #[doc = " Number of packets removed from reorder buffer"]
    pub reorder_free_mpdus: ::core::ffi::c_uint,
    #[doc = " Number of Rx packets resubmitted to LMAC by UMAC"]
    pub umac_consumed_pkts: ::core::ffi::c_uint,
    #[doc = " Number of Rx packets sent to Host for resubmiting"]
    pub host_consumed_pkts: ::core::ffi::c_uint,
    #[doc = " Total events posted to UMAC RX thread from LMAC"]
    pub rx_mbox_post: ::core::ffi::c_uint,
    #[doc = " Total events received to UMAC RX thread from LMAC"]
    pub rx_mbox_receive: ::core::ffi::c_uint,
    #[doc = " Number of packets received in out of order"]
    pub reordering_ampdu: ::core::ffi::c_uint,
    #[doc = " Messages posted  to TX mbox from timer ISR"]
    pub timer_mbox_post: ::core::ffi::c_uint,
    #[doc = " Messages received from timer ISR"]
    pub timer_mbox_rcv: ::core::ffi::c_uint,
    #[doc = " Messages posted to TX mbox from work scheduler"]
    pub work_mbox_post: ::core::ffi::c_uint,
    #[doc = " Messages received from work scheduler"]
    pub work_mbox_rcv: ::core::ffi::c_uint,
    #[doc = " Messages posted to TX mbox from tasklet function"]
    pub tasklet_mbox_post: ::core::ffi::c_uint,
    #[doc = " Messages received from tasklet function"]
    pub tasklet_mbox_rcv: ::core::ffi::c_uint,
    #[doc = " Management frames sent to userspace"]
    pub userspace_offload_frames: ::core::ffi::c_uint,
    #[doc = " Number of times where requested buffer size is not available\n  and allocated from next available memory buffer"]
    pub alloc_buf_fail: ::core::ffi::c_uint,
    #[doc = " Total packets count in RX thread"]
    pub rx_packet_total_count: ::core::ffi::c_uint,
    #[doc = " Number of data packets received"]
    pub rx_packet_data_count: ::core::ffi::c_uint,
    #[doc = " Number of Qos data packets received"]
    pub rx_packet_qos_data_count: ::core::ffi::c_uint,
    #[doc = " Number of protected data packets received"]
    pub rx_packet_protected_data_count: ::core::ffi::c_uint,
    #[doc = " Number of management packets received"]
    pub rx_packet_mgmt_count: ::core::ffi::c_uint,
    #[doc = " Number of beacon packets received"]
    pub rx_packet_beacon_count: ::core::ffi::c_uint,
    #[doc = " Number of probe response packets received"]
    pub rx_packet_probe_resp_count: ::core::ffi::c_uint,
    #[doc = " Number of authentication packets received"]
    pub rx_packet_auth_count: ::core::ffi::c_uint,
    #[doc = " Number of deauthentication packets received"]
    pub rx_packet_deauth_count: ::core::ffi::c_uint,
    #[doc = " Number of assoc response packets received"]
    pub rx_packet_assoc_resp_count: ::core::ffi::c_uint,
    #[doc = " Number of disassociation packets received"]
    pub rx_packet_disassoc_count: ::core::ffi::c_uint,
    #[doc = " Number of action frames received"]
    pub rx_packet_action_count: ::core::ffi::c_uint,
    #[doc = " Number of probe request packets received"]
    pub rx_packet_probe_req_count: ::core::ffi::c_uint,
    #[doc = " Other management packets received"]
    pub rx_packet_other_mgmt_count: ::core::ffi::c_uint,
    #[doc = " Maximum coalised packets received from LMAC in any RX event"]
    pub max_coalesce_pkts: ::core::ffi::c_schar,
    #[doc = " Packets received with null skb pointer from LMAC"]
    pub null_skb_pointer_from_lmac: ::core::ffi::c_uint,
    #[doc = " Number of unexpected management packets received in coalesce event"]
    pub unexpected_mgmt_pkt: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_umac_rx_dbg_params() {
    const UNINIT: ::core::mem::MaybeUninit<umac_rx_dbg_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<umac_rx_dbg_params>(),
        149usize,
        concat!("Size of: ", stringify!(umac_rx_dbg_params))
    );
    assert_eq!(
        ::core::mem::align_of::<umac_rx_dbg_params>(),
        1usize,
        concat!("Alignment of ", stringify!(umac_rx_dbg_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac_events) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(lmac_events)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_events) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_events)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_coalesce_events) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_coalesce_events)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).total_rx_pkts_from_lmac) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(total_rx_pkts_from_lmac)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_refill_gap) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(max_refill_gap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).current_refill_gap) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(current_refill_gap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).out_of_order_mpdus) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(out_of_order_mpdus)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reorder_free_mpdus) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(reorder_free_mpdus)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_consumed_pkts) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(umac_consumed_pkts)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).host_consumed_pkts) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(host_consumed_pkts)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_mbox_post) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_mbox_post)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_mbox_receive) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_mbox_receive)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reordering_ampdu) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(reordering_ampdu)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timer_mbox_post) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(timer_mbox_post)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timer_mbox_rcv) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(timer_mbox_rcv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).work_mbox_post) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(work_mbox_post)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).work_mbox_rcv) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(work_mbox_rcv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tasklet_mbox_post) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(tasklet_mbox_post)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tasklet_mbox_rcv) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(tasklet_mbox_rcv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).userspace_offload_frames) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(userspace_offload_frames)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).alloc_buf_fail) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(alloc_buf_fail)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_total_count) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_total_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_data_count) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_data_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_qos_data_count) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_qos_data_count)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).rx_packet_protected_data_count) as usize - ptr as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_protected_data_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_mgmt_count) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_mgmt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_beacon_count) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_beacon_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_probe_resp_count) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_probe_resp_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_auth_count) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_auth_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_deauth_count) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_deauth_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_assoc_resp_count) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_assoc_resp_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_disassoc_count) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_disassoc_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_action_count) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_action_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_probe_req_count) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_probe_req_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_other_mgmt_count) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_other_mgmt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_coalesce_pkts) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(max_coalesce_pkts)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).null_skb_pointer_from_lmac) as usize - ptr as usize },
        141usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(null_skb_pointer_from_lmac)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unexpected_mgmt_pkt) as usize - ptr as usize },
        145usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(unexpected_mgmt_pkt)
        )
    );
}
#[doc = " @brief This structure specifies the UMAC TX (transmit) debug parameters used for\n  debugging purposes.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct umac_tx_dbg_params {
    #[doc = " Total number of tx commands received from host"]
    pub tx_cmd: ::core::ffi::c_uint,
    #[doc = " Non coalesce packets received"]
    pub tx_non_coalesce_pkts_rcvd_from_host: ::core::ffi::c_uint,
    #[doc = " coalesce packets received"]
    pub tx_coalesce_pkts_rcvd_from_host: ::core::ffi::c_uint,
    #[doc = " Maximum number of coalesce packets received in any\n  TX command coalesce packets received"]
    pub tx_max_coalesce_pkts_rcvd_from_host: ::core::ffi::c_uint,
    #[doc = " Maximum Tx commands currently in process at any point of time in UMAC"]
    pub tx_cmds_max_used: ::core::ffi::c_uint,
    #[doc = " Number of Tx commands that are currently in process in UMAC"]
    pub tx_cmds_currently_in_use: ::core::ffi::c_uint,
    #[doc = " Number of tx done events sent to host"]
    pub tx_done_events_send_to_host: ::core::ffi::c_uint,
    #[doc = " Number of tx done success packets sent to host"]
    pub tx_done_success_pkts_to_host: ::core::ffi::c_uint,
    #[doc = " Number of tx done failure packets sent to host"]
    pub tx_done_failure_pkts_to_host: ::core::ffi::c_uint,
    #[doc = " Number of packets received from host that needs to be encrypted"]
    pub tx_cmds_with_crypto_pkts_rcvd_from_host: ::core::ffi::c_uint,
    #[doc = " Number of packets received from host that need not to be encrypted"]
    pub tx_cmds_with_non_crypto_pkts_rcvd_from_host: ::core::ffi::c_uint,
    #[doc = " Number of broadcast\tpackets received from host"]
    pub tx_cmds_with_broadcast_pkts_rcvd_from_host: ::core::ffi::c_uint,
    #[doc = " Number of multicast\tpackets received from host"]
    pub tx_cmds_with_multicast_pkts_rcvd_from_host: ::core::ffi::c_uint,
    #[doc = " Number of unicast packets received from host"]
    pub tx_cmds_with_unicast_pkts_rcvd_from_host: ::core::ffi::c_uint,
    #[doc = " UMAC internal count"]
    pub xmit: ::core::ffi::c_uint,
    #[doc = " Number of addba requests sent"]
    pub send_addba_req: ::core::ffi::c_uint,
    #[doc = " Total ADD BA responses received from host"]
    pub addba_resp: ::core::ffi::c_uint,
    #[doc = " Total packets received in softmac tx function"]
    pub softmac_tx: ::core::ffi::c_uint,
    #[doc = " Number of packets generated internally in UMAC"]
    pub internal_pkts: ::core::ffi::c_uint,
    #[doc = " Number of packets Received from host"]
    pub external_pkts: ::core::ffi::c_uint,
    #[doc = " Total tx commmands sent to lmac"]
    pub tx_cmds_to_lmac: ::core::ffi::c_uint,
    #[doc = " Tx dones received from LMAC"]
    pub tx_dones_from_lmac: ::core::ffi::c_uint,
    #[doc = " Total commands sent to lmac in UMAC hal"]
    pub total_cmds_to_lmac: ::core::ffi::c_uint,
    #[doc = " Number of data packets sent"]
    pub tx_packet_data_count: ::core::ffi::c_uint,
    #[doc = " Number of management packets sent"]
    pub tx_packet_mgmt_count: ::core::ffi::c_uint,
    #[doc = " Number of beacon packets sent"]
    pub tx_packet_beacon_count: ::core::ffi::c_uint,
    #[doc = " Number of probe request packets sent"]
    pub tx_packet_probe_req_count: ::core::ffi::c_uint,
    #[doc = " Number of authentication packets sent"]
    pub tx_packet_auth_count: ::core::ffi::c_uint,
    #[doc = " Number of deauthentication packets sent"]
    pub tx_packet_deauth_count: ::core::ffi::c_uint,
    #[doc = " Number of association request packets sent"]
    pub tx_packet_assoc_req_count: ::core::ffi::c_uint,
    #[doc = " Number of disassociation packets sent"]
    pub tx_packet_disassoc_count: ::core::ffi::c_uint,
    #[doc = " Number of action packets sent"]
    pub tx_packet_action_count: ::core::ffi::c_uint,
    #[doc = " Other management packets sent"]
    pub tx_packet_other_mgmt_count: ::core::ffi::c_uint,
    #[doc = " Number of Non management packets sent"]
    pub tx_packet_non_mgmt_data_count: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_umac_tx_dbg_params() {
    const UNINIT: ::core::mem::MaybeUninit<umac_tx_dbg_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<umac_tx_dbg_params>(),
        136usize,
        concat!("Size of: ", stringify!(umac_tx_dbg_params))
    );
    assert_eq!(
        ::core::mem::align_of::<umac_tx_dbg_params>(),
        1usize,
        concat!("Alignment of ", stringify!(umac_tx_dbg_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_cmd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmd)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).tx_non_coalesce_pkts_rcvd_from_host) as usize
                - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_non_coalesce_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).tx_coalesce_pkts_rcvd_from_host) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_coalesce_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).tx_max_coalesce_pkts_rcvd_from_host) as usize
                - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_max_coalesce_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_cmds_max_used) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_max_used)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_cmds_currently_in_use) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_currently_in_use)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).tx_done_events_send_to_host) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_done_events_send_to_host)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).tx_done_success_pkts_to_host) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_done_success_pkts_to_host)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).tx_done_failure_pkts_to_host) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_done_failure_pkts_to_host)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).tx_cmds_with_crypto_pkts_rcvd_from_host) as usize
                - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_with_crypto_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).tx_cmds_with_non_crypto_pkts_rcvd_from_host) as usize
                - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_with_non_crypto_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).tx_cmds_with_broadcast_pkts_rcvd_from_host) as usize
                - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_with_broadcast_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).tx_cmds_with_multicast_pkts_rcvd_from_host) as usize
                - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_with_multicast_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).tx_cmds_with_unicast_pkts_rcvd_from_host) as usize
                - ptr as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_with_unicast_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xmit) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(xmit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).send_addba_req) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(send_addba_req)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).addba_resp) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(addba_resp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).softmac_tx) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(softmac_tx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).internal_pkts) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(internal_pkts)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).external_pkts) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(external_pkts)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_cmds_to_lmac) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_to_lmac)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_dones_from_lmac) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_dones_from_lmac)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).total_cmds_to_lmac) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(total_cmds_to_lmac)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_data_count) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_data_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_mgmt_count) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_mgmt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_beacon_count) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_beacon_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_probe_req_count) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_probe_req_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_auth_count) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_auth_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_deauth_count) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_deauth_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_assoc_req_count) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_assoc_req_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_disassoc_count) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_disassoc_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_action_count) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_action_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_other_mgmt_count) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_other_mgmt_count)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).tx_packet_non_mgmt_data_count) as usize - ptr as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_non_mgmt_data_count)
        )
    );
}
#[doc = " @brief This structure specifies the UMAC command and event debug parameters used for\n  debugging purpose.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct umac_cmd_evnt_dbg_params {
    #[doc = " Number of command init received from host"]
    pub cmd_init: ::core::ffi::c_uchar,
    #[doc = " Number of init_done events sent to host"]
    pub event_init_done: ::core::ffi::c_uchar,
    #[doc = " Number of rf test command received from host"]
    pub cmd_rf_test: ::core::ffi::c_uchar,
    #[doc = " Number of connect command received from host"]
    pub cmd_connect: ::core::ffi::c_uchar,
    #[doc = " Number of get_stats command received from host"]
    pub cmd_get_stats: ::core::ffi::c_uint,
    #[doc = " Number of power save state events sent to host"]
    pub event_ps_state: ::core::ffi::c_uint,
    #[doc = " Unused"]
    pub cmd_set_reg: ::core::ffi::c_uint,
    #[doc = " Number of get regulatory commands received from host"]
    pub cmd_get_reg: ::core::ffi::c_uint,
    #[doc = " Number of request set regulatory commands received from host"]
    pub cmd_req_set_reg: ::core::ffi::c_uint,
    #[doc = " Number of trigger scan commands received from host"]
    pub cmd_trigger_scan: ::core::ffi::c_uint,
    #[doc = " Number of scan done events sent to host"]
    pub event_scan_done: ::core::ffi::c_uint,
    #[doc = " Number of get scan commands received from the host to get scan results"]
    pub cmd_get_scan: ::core::ffi::c_uint,
    #[doc = " Number of scan commands sent to LMAC"]
    pub umac_scan_req: ::core::ffi::c_uint,
    #[doc = " Number of scan complete events received from LMAC"]
    pub umac_scan_complete: ::core::ffi::c_uint,
    #[doc = " Number of scan requests received from host when previous scan is in progress"]
    pub umac_scan_busy: ::core::ffi::c_uint,
    #[doc = " Number of authentication requests received from host"]
    pub cmd_auth: ::core::ffi::c_uint,
    #[doc = " Number of association requests received from host"]
    pub cmd_assoc: ::core::ffi::c_uint,
    #[doc = " Number of deauthentication requests received from host"]
    pub cmd_deauth: ::core::ffi::c_uint,
    #[doc = " Number of register frame commands received from host to register\n  a management frame type which should be passed to host"]
    pub cmd_register_frame: ::core::ffi::c_uint,
    #[doc = " Number of command frames from host which will be used for\n  transmitting management frames"]
    pub cmd_frame: ::core::ffi::c_uint,
    #[doc = " Number of delete key commands from host"]
    pub cmd_del_key: ::core::ffi::c_uint,
    #[doc = " Number of new key commands received from host"]
    pub cmd_new_key: ::core::ffi::c_uint,
    #[doc = " Number of set key commands received from host"]
    pub cmd_set_key: ::core::ffi::c_uint,
    #[doc = " Number of get key commands received from host"]
    pub cmd_get_key: ::core::ffi::c_uint,
    #[doc = " Number of beacon hint events sent to host"]
    pub event_beacon_hint: ::core::ffi::c_uint,
    #[doc = " Number of regulatory change events sent to host when regulatory change command\n  received from host such as in response to command NL80211_CMD_REG_CHANGE"]
    pub event_reg_change: ::core::ffi::c_uint,
    #[doc = " Number of regulatory change events sent to host other than\n  host request for regulatory change"]
    pub event_wiphy_reg_change: ::core::ffi::c_uint,
    #[doc = " Number of set station commands received from host"]
    pub cmd_set_station: ::core::ffi::c_uint,
    #[doc = " Number of new station commands received from host"]
    pub cmd_new_station: ::core::ffi::c_uint,
    #[doc = " Number of del station commands received from host"]
    pub cmd_del_station: ::core::ffi::c_uint,
    #[doc = " Number of new interface commands received from host"]
    pub cmd_new_interface: ::core::ffi::c_uint,
    #[doc = " Number of set interface commands received from host"]
    pub cmd_set_interface: ::core::ffi::c_uint,
    #[doc = " Number of get interface commands received from host"]
    pub cmd_get_interface: ::core::ffi::c_uint,
    #[doc = " Number of set_ifflags commands received from host"]
    pub cmd_set_ifflags: ::core::ffi::c_uint,
    #[doc = " Number of set_ifflags events sent to host"]
    pub cmd_set_ifflags_done: ::core::ffi::c_uint,
    #[doc = " Number of set bss command received from host"]
    pub cmd_set_bss: ::core::ffi::c_uint,
    #[doc = " Number of set wiphy command received from host"]
    pub cmd_set_wiphy: ::core::ffi::c_uint,
    #[doc = " Number of start access point command received from host"]
    pub cmd_start_ap: ::core::ffi::c_uint,
    #[doc = " Number of power save configuration commands sent to LMAC"]
    pub LMAC_CMD_PS: ::core::ffi::c_uint,
    #[doc = " Current power save state configured to LMAC through LMAC_CMD_PS command"]
    pub CURR_STATE: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_umac_cmd_evnt_dbg_params() {
    const UNINIT: ::core::mem::MaybeUninit<umac_cmd_evnt_dbg_params> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<umac_cmd_evnt_dbg_params>(),
        148usize,
        concat!("Size of: ", stringify!(umac_cmd_evnt_dbg_params))
    );
    assert_eq!(
        ::core::mem::align_of::<umac_cmd_evnt_dbg_params>(),
        1usize,
        concat!("Alignment of ", stringify!(umac_cmd_evnt_dbg_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_init) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_init)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_init_done) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(event_init_done)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_rf_test) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_rf_test)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_connect) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_connect)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_get_stats) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_get_stats)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_ps_state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(event_ps_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_reg) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_reg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_get_reg) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_get_reg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_req_set_reg) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_req_set_reg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_trigger_scan) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_trigger_scan)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_scan_done) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(event_scan_done)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_get_scan) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_get_scan)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_scan_req) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(umac_scan_req)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_scan_complete) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(umac_scan_complete)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_scan_busy) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(umac_scan_busy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_auth) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_auth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_assoc) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_assoc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_deauth) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_deauth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_register_frame) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_register_frame)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_frame) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_frame)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_del_key) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_del_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_new_key) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_new_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_key) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_get_key) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_get_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_beacon_hint) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(event_beacon_hint)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_reg_change) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(event_reg_change)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_wiphy_reg_change) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(event_wiphy_reg_change)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_station) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_station)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_new_station) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_new_station)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_del_station) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_del_station)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_new_interface) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_new_interface)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_interface) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_interface)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_get_interface) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_get_interface)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_ifflags) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_ifflags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_ifflags_done) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_ifflags_done)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_bss) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_bss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_wiphy) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_wiphy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_start_ap) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_start_ap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LMAC_CMD_PS) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(LMAC_CMD_PS)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CURR_STATE) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(CURR_STATE)
        )
    );
}
#[doc = " @brief This structure specifies the UMAC interface debug parameters used for debugging purpose.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_interface_stats {
    #[doc = " Number of unicast packets sent"]
    pub tx_unicast_pkt_count: ::core::ffi::c_uint,
    #[doc = " Number of multicast packets sent"]
    pub tx_multicast_pkt_count: ::core::ffi::c_uint,
    #[doc = " Number of broadcast packets sent"]
    pub tx_broadcast_pkt_count: ::core::ffi::c_uint,
    #[doc = " Number of tx data bytes sent"]
    pub tx_bytes: ::core::ffi::c_uint,
    #[doc = " Number of unicast packets received"]
    pub rx_unicast_pkt_count: ::core::ffi::c_uint,
    #[doc = " Number of multicast packets received"]
    pub rx_multicast_pkt_count: ::core::ffi::c_uint,
    #[doc = " Number of broadcast packets received"]
    pub rx_broadcast_pkt_count: ::core::ffi::c_uint,
    #[doc = " Number of beacon packets received"]
    pub rx_beacon_success_count: ::core::ffi::c_uint,
    #[doc = " Number of beacon packets missed"]
    pub rx_beacon_miss_count: ::core::ffi::c_uint,
    #[doc = " Number of rx data bytes received"]
    pub rx_bytes: ::core::ffi::c_uint,
    #[doc = " Number of packets with checksum mismatch received"]
    pub rx_checksum_error_count: ::core::ffi::c_uint,
    #[doc = " Number of duplicate packets received"]
    pub replay_attack_drop_cnt: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_nrf_wifi_interface_stats() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_interface_stats> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_interface_stats>(),
        48usize,
        concat!("Size of: ", stringify!(nrf_wifi_interface_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_interface_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_interface_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_unicast_pkt_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(tx_unicast_pkt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_multicast_pkt_count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(tx_multicast_pkt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_broadcast_pkt_count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(tx_broadcast_pkt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_bytes) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(tx_bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_unicast_pkt_count) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(rx_unicast_pkt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_multicast_pkt_count) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(rx_multicast_pkt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_broadcast_pkt_count) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(rx_broadcast_pkt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_beacon_success_count) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(rx_beacon_success_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_beacon_miss_count) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(rx_beacon_miss_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_bytes) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(rx_bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_checksum_error_count) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(rx_checksum_error_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).replay_attack_drop_cnt) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(replay_attack_drop_cnt)
        )
    );
}
#[doc = " @brief This structure defines the UMAC debug statistics. It contains the necessary parameters\n  and fields used to gather and present debugging statistics within the UMAC layer.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_umac_stats {
    #[doc = " Transmit debug statistics @ref umac_tx_dbg_params"]
    pub tx_dbg_params: umac_tx_dbg_params,
    #[doc = " Receive debug statistics @ref umac_rx_dbg_params"]
    pub rx_dbg_params: umac_rx_dbg_params,
    #[doc = " Command Event debug statistics @ref umac_cmd_evnt_dbg_params"]
    pub cmd_evnt_dbg_params: umac_cmd_evnt_dbg_params,
    #[doc = " Interface debug parameters @ref nrf_wifi_interface_stats"]
    pub interface_data_stats: nrf_wifi_interface_stats,
}
#[test]
fn bindgen_test_layout_rpu_umac_stats() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_umac_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_umac_stats>(),
        481usize,
        concat!("Size of: ", stringify!(rpu_umac_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_umac_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_umac_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_dbg_params) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_umac_stats),
            "::",
            stringify!(tx_dbg_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_dbg_params) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_umac_stats),
            "::",
            stringify!(rx_dbg_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_evnt_dbg_params) as usize - ptr as usize },
        285usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_umac_stats),
            "::",
            stringify!(cmd_evnt_dbg_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).interface_data_stats) as usize - ptr as usize },
        433usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_umac_stats),
            "::",
            stringify!(interface_data_stats)
        )
    );
}
#[doc = " @brief This structure defines the LMAC debug parameters.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_lmac_stats {
    #[doc = " Number of reset command counts from UMAC"]
    pub reset_cmd_cnt: ::core::ffi::c_uint,
    #[doc = " Number of reset complete events sent to UMAC"]
    pub reset_complete_event_cnt: ::core::ffi::c_uint,
    #[doc = " Number of events unable to generate"]
    pub unable_gen_event: ::core::ffi::c_uint,
    #[doc = " Number of channel program commands from UMAC"]
    pub ch_prog_cmd_cnt: ::core::ffi::c_uint,
    #[doc = " Number of channel program done events to UMAC"]
    pub channel_prog_done: ::core::ffi::c_uint,
    #[doc = " Number of Tx commands from UMAC"]
    pub tx_pkt_cnt: ::core::ffi::c_uint,
    #[doc = " Number of Tx done events to UMAC"]
    pub tx_pkt_done_cnt: ::core::ffi::c_uint,
    #[doc = " Unused"]
    pub scan_pkt_cnt: ::core::ffi::c_uint,
    #[doc = " Number of internal Tx packets"]
    pub internal_pkt_cnt: ::core::ffi::c_uint,
    #[doc = " Number of Tx dones for internal packets"]
    pub internal_pkt_done_cnt: ::core::ffi::c_uint,
    #[doc = " Number of acknowledgment responses"]
    pub ack_resp_cnt: ::core::ffi::c_uint,
    #[doc = " Number of transmit timeouts"]
    pub tx_timeout: ::core::ffi::c_uint,
    #[doc = " Number of deaggregation ISRs"]
    pub deagg_isr: ::core::ffi::c_uint,
    #[doc = " Number of deaggregation input descriptor empties"]
    pub deagg_inptr_desc_empty: ::core::ffi::c_uint,
    #[doc = " Number of deaggregation circular buffer full events"]
    pub deagg_circular_buffer_full: ::core::ffi::c_uint,
    #[doc = " Number of LMAC received ISRs"]
    pub lmac_rxisr_cnt: ::core::ffi::c_uint,
    #[doc = " Number of received packets decrypted"]
    pub rx_decryptcnt: ::core::ffi::c_uint,
    #[doc = " Number of packet decryption failures during processing"]
    pub process_decrypt_fail: ::core::ffi::c_uint,
    #[doc = " Number of RX event preparation failures"]
    pub prepa_rx_event_fail: ::core::ffi::c_uint,
    #[doc = " Number of RX core pool full counts"]
    pub rx_core_pool_full_cnt: ::core::ffi::c_uint,
    #[doc = " Number of RX MPDU CRC successes"]
    pub rx_mpdu_crc_success_cnt: ::core::ffi::c_uint,
    #[doc = " Number of RX MPDU CRC failures"]
    pub rx_mpdu_crc_fail_cnt: ::core::ffi::c_uint,
    #[doc = " Number of RX OFDM CRC successes"]
    pub rx_ofdm_crc_success_cnt: ::core::ffi::c_uint,
    #[doc = " Number of RX OFDM CRC failures"]
    pub rx_ofdm_crc_fail_cnt: ::core::ffi::c_uint,
    #[doc = " Number of RX DSSS CRC successes"]
    pub rxDSSSCrcSuccessCnt: ::core::ffi::c_uint,
    #[doc = " Number of RX DSSS CRC failures"]
    pub rxDSSSCrcFailCnt: ::core::ffi::c_uint,
    #[doc = " Number of RX crypto start counts"]
    pub rx_crypto_start_cnt: ::core::ffi::c_uint,
    #[doc = " Number of RX crypto done counts"]
    pub rx_crypto_done_cnt: ::core::ffi::c_uint,
    #[doc = " Number of RX event buffer full counts"]
    pub rx_event_buf_full: ::core::ffi::c_uint,
    #[doc = " Number of RX external RAM buffer full counts"]
    pub rx_extram_buf_full: ::core::ffi::c_uint,
    #[doc = " Number of scan requests receive from UMAC"]
    pub scan_req: ::core::ffi::c_uint,
    #[doc = " Number of scan complete events sent to UMAC"]
    pub scan_complete: ::core::ffi::c_uint,
    #[doc = " Number of scan abort requests"]
    pub scan_abort_req: ::core::ffi::c_uint,
    #[doc = " Number of scan abort complete events"]
    pub scan_abort_complete: ::core::ffi::c_uint,
    #[doc = " Number of internal buffer pool null counts"]
    pub internal_buf_pool_null: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_rpu_lmac_stats() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_lmac_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_lmac_stats>(),
        140usize,
        concat!("Size of: ", stringify!(rpu_lmac_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_lmac_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_lmac_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reset_cmd_cnt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(reset_cmd_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reset_complete_event_cnt) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(reset_complete_event_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unable_gen_event) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(unable_gen_event)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ch_prog_cmd_cnt) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(ch_prog_cmd_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channel_prog_done) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(channel_prog_done)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_cnt) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(tx_pkt_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_done_cnt) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(tx_pkt_done_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_pkt_cnt) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(scan_pkt_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).internal_pkt_cnt) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(internal_pkt_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).internal_pkt_done_cnt) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(internal_pkt_done_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ack_resp_cnt) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(ack_resp_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_timeout) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(tx_timeout)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deagg_isr) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(deagg_isr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deagg_inptr_desc_empty) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(deagg_inptr_desc_empty)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deagg_circular_buffer_full) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(deagg_circular_buffer_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac_rxisr_cnt) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(lmac_rxisr_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_decryptcnt) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_decryptcnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).process_decrypt_fail) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(process_decrypt_fail)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prepa_rx_event_fail) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(prepa_rx_event_fail)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_core_pool_full_cnt) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_core_pool_full_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_mpdu_crc_success_cnt) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_mpdu_crc_success_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_mpdu_crc_fail_cnt) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_mpdu_crc_fail_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_ofdm_crc_success_cnt) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_ofdm_crc_success_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_ofdm_crc_fail_cnt) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_ofdm_crc_fail_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rxDSSSCrcSuccessCnt) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rxDSSSCrcSuccessCnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rxDSSSCrcFailCnt) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rxDSSSCrcFailCnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_crypto_start_cnt) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_crypto_start_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_crypto_done_cnt) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_crypto_done_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_event_buf_full) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_event_buf_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_extram_buf_full) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_extram_buf_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_req) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(scan_req)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_complete) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(scan_complete)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_abort_req) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(scan_abort_req)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_abort_complete) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(scan_abort_complete)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).internal_buf_pool_null) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(internal_buf_pool_null)
        )
    );
}
#[doc = " @brief This structure defines the PHY (Physical Layer) debug statistics.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_phy_stats {
    #[doc = " Rssi average value received from LMAC"]
    pub rssi_avg: ::core::ffi::c_schar,
    #[doc = " Unused"]
    pub pdout_val: ::core::ffi::c_uchar,
    #[doc = " Number of OFDM CRC Pass packets"]
    pub ofdm_crc32_pass_cnt: ::core::ffi::c_uint,
    #[doc = " Number of OFDM CRC Fail packets"]
    pub ofdm_crc32_fail_cnt: ::core::ffi::c_uint,
    #[doc = " Number of DSSS CRC Pass packets"]
    pub dsss_crc32_pass_cnt: ::core::ffi::c_uint,
    #[doc = " Number of DSSS CRC Fail packets"]
    pub dsss_crc32_fail_cnt: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_rpu_phy_stats() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_phy_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_phy_stats>(),
        18usize,
        concat!("Size of: ", stringify!(rpu_phy_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_phy_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_phy_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rssi_avg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_phy_stats),
            "::",
            stringify!(rssi_avg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pdout_val) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_phy_stats),
            "::",
            stringify!(pdout_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ofdm_crc32_pass_cnt) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_phy_stats),
            "::",
            stringify!(ofdm_crc32_pass_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ofdm_crc32_fail_cnt) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_phy_stats),
            "::",
            stringify!(ofdm_crc32_fail_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dsss_crc32_pass_cnt) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_phy_stats),
            "::",
            stringify!(dsss_crc32_pass_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dsss_crc32_fail_cnt) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_phy_stats),
            "::",
            stringify!(dsss_crc32_fail_cnt)
        )
    );
}
#[doc = " @brief The UMAC header structure for system commands and events defines the format\n  used to transmit and receive system-level commands and events.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_sys_head {
    #[doc = " Command/Event id"]
    pub cmd_event: ::core::ffi::c_uint,
    #[doc = " message length"]
    pub len: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_nrf_wifi_sys_head() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_sys_head> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_sys_head>(),
        8usize,
        concat!("Size of: ", stringify!(nrf_wifi_sys_head))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_sys_head>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_sys_head))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_event) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_head),
            "::",
            stringify!(cmd_event)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_head),
            "::",
            stringify!(len)
        )
    );
}
#[repr(u32)]
#[doc = " @brief The maximum Rx (receive) A-MPDU size in KB.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum max_rx_ampdu_size {
    #[doc = " 8KB AMPDU Size"]
    MAX_RX_AMPDU_SIZE_8KB = 0,
    #[doc = " 16KB AMPDU Size"]
    MAX_RX_AMPDU_SIZE_16KB = 1,
    #[doc = " 32KB AMPDU Size"]
    MAX_RX_AMPDU_SIZE_32KB = 2,
    #[doc = " 64KB AMPDU Size"]
    MAX_RX_AMPDU_SIZE_64KB = 3,
}
#[doc = " @brief This structure specifies the configuration parameters used for configuring\n  data-related settings.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_data_config_params {
    #[doc = " rate_protection_type:0->NONE, 1->RTS/CTS, 2->CTS2SELF"]
    pub rate_protection_type: ::core::ffi::c_uchar,
    #[doc = " Aggregation is enabled(NRF_WIFI_FEATURE_ENABLE) or\n  disabled(NRF_WIFI_FEATURE_DISABLE)"]
    pub aggregation: ::core::ffi::c_uchar,
    #[doc = " WMM is enabled(NRF_WIFI_FEATURE_ENABLE) or\n  disabled(NRF_WIFI_FEATURE_DISABLE)"]
    pub wmm: ::core::ffi::c_uchar,
    #[doc = " Max number of aggregated TX sessions"]
    pub max_num_tx_agg_sessions: ::core::ffi::c_uchar,
    #[doc = " Max number of aggregated RX sessions"]
    pub max_num_rx_agg_sessions: ::core::ffi::c_uchar,
    #[doc = " maximum aggregation size"]
    pub max_tx_aggregation: ::core::ffi::c_uchar,
    #[doc = " Reorder buffer size (1 to 64)"]
    pub reorder_buf_size: ::core::ffi::c_uchar,
    #[doc = " Max RX AMPDU size (8/16/32/64 KB), see &enum max_rx_ampdu_size"]
    pub max_rxampdu_size: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_nrf_wifi_data_config_params() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_data_config_params> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_data_config_params>(),
        11usize,
        concat!("Size of: ", stringify!(nrf_wifi_data_config_params))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_data_config_params>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_data_config_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rate_protection_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(rate_protection_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aggregation) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(aggregation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wmm) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(wmm)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_num_tx_agg_sessions) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(max_num_tx_agg_sessions)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_num_rx_agg_sessions) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(max_num_rx_agg_sessions)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_tx_aggregation) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(max_tx_aggregation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reorder_buf_size) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(reorder_buf_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_rxampdu_size) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(max_rxampdu_size)
        )
    );
}
#[doc = " @brief This structure specifies the parameters that need to be provided for the command\n  NRF_WIFI_CMD_INIT. The NRF_WIFI_CMD_INIT command is typically used to initialize the\n  Wi-Fi module and prepare it for further communication.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_sys_params {
    #[doc = " enable rpu sleep"]
    pub sleep_enable: ::core::ffi::c_uint,
    #[doc = " Normal/FTM mode"]
    pub hw_bringup_time: ::core::ffi::c_uint,
    #[doc = " Antenna Configuration, applicable only for 1x1"]
    pub sw_bringup_time: ::core::ffi::c_uint,
    #[doc = " Internal tuning parameter"]
    pub bcn_time_out: ::core::ffi::c_uint,
    #[doc = " Set to 1 if rpu is expected to perform sleep clock calibration"]
    pub calib_sleep_clk: ::core::ffi::c_uint,
    #[doc = " calib bit map value. More info can be found in phy_rf_params.h NRF_WIFI_DEF_PHY_CALIB"]
    pub phy_calib: ::core::ffi::c_uint,
    #[doc = " MAC address of the interface"]
    pub mac_addr: [::core::ffi::c_uchar; 6usize],
    #[doc = " An array containing RF & baseband control params"]
    pub rf_params: [::core::ffi::c_uchar; 200usize],
    #[doc = " Indicates whether the rf_params has a valid value"]
    pub rf_params_valid: ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_nrf_wifi_sys_params() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_sys_params> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_sys_params>(),
        231usize,
        concat!("Size of: ", stringify!(nrf_wifi_sys_params))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_sys_params>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_sys_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sleep_enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(sleep_enable)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hw_bringup_time) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(hw_bringup_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_bringup_time) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(sw_bringup_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bcn_time_out) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(bcn_time_out)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).calib_sleep_clk) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(calib_sleep_clk)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_calib) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(phy_calib)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac_addr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(mac_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rf_params) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(rf_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rf_params_valid) as usize - ptr as usize },
        230usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(rf_params_valid)
        )
    );
}
#[doc = " @brief This structure defines the parameters used to control the transmit (TX) power.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_tx_pwr_ctrl_params {
    #[doc = " Antenna gain for 2.4 GHz band"]
    pub ant_gain_2g: ::core::ffi::c_uchar,
    #[doc = " Antenna gain for 5 GHz band (5150 MHz - 5350 MHz)"]
    pub ant_gain_5g_band1: ::core::ffi::c_uchar,
    #[doc = " Antenna gain for 5 GHz band (5470 MHz - 5730 MHz)"]
    pub ant_gain_5g_band2: ::core::ffi::c_uchar,
    #[doc = " Antenna gain for 5 GHz band (5730 MHz - 5895 MHz)"]
    pub ant_gain_5g_band3: ::core::ffi::c_uchar,
    #[doc = " Transmit power backoff (in dB) for lower edge of 2.4 GHz frequency band"]
    pub band_edge_2g_lo: ::core::ffi::c_uchar,
    #[doc = " Transmit power backoff (in dB) for upper edge of 2.4 GHz frequency band"]
    pub band_edge_2g_hi: ::core::ffi::c_uchar,
    #[doc = " Transmit power backoff (in dB) for lower edge of UNII-1 frequency band"]
    pub band_edge_5g_unii_1_lo: ::core::ffi::c_uchar,
    #[doc = " Transmit power backoff (in dB) for upper edge of UNII-1 frequency band"]
    pub band_edge_5g_unii_1_hi: ::core::ffi::c_uchar,
    #[doc = " Transmit power backoff (in dB) for lower edge of UNII-2A frequency band"]
    pub band_edge_5g_unii_2a_lo: ::core::ffi::c_uchar,
    #[doc = " Transmit power backoff (in dB) for upper edge of UNII-2A frequency band"]
    pub band_edge_5g_unii_2a_hi: ::core::ffi::c_uchar,
    #[doc = " Transmit power backoff (in dB) for lower edge of UNII-2C frequency band"]
    pub band_edge_5g_unii_2c_lo: ::core::ffi::c_uchar,
    #[doc = " Transmit power backoff (in dB) for upper edge of UNII-2C frequency band"]
    pub band_edge_5g_unii_2c_hi: ::core::ffi::c_uchar,
    #[doc = " Transmit power backoff (in dB) for lower edge of UNII-3 frequency band"]
    pub band_edge_5g_unii_3_lo: ::core::ffi::c_uchar,
    #[doc = " Transmit power backoff (in dB) for upper edge of UNII-3 frequency band"]
    pub band_edge_5g_unii_3_hi: ::core::ffi::c_uchar,
    #[doc = " Transmit power backoff (in dB) for lower edge of UNII-4 frequency band"]
    pub band_edge_5g_unii_4_lo: ::core::ffi::c_uchar,
    #[doc = " Transmit power backoff (in dB) for upper edge of UNII-4 frequency band"]
    pub band_edge_5g_unii_4_hi: ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_nrf_wifi_tx_pwr_ctrl_params() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_tx_pwr_ctrl_params> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_tx_pwr_ctrl_params>(),
        16usize,
        concat!("Size of: ", stringify!(nrf_wifi_tx_pwr_ctrl_params))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_tx_pwr_ctrl_params>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_tx_pwr_ctrl_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ant_gain_2g) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(ant_gain_2g)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ant_gain_5g_band1) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(ant_gain_5g_band1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ant_gain_5g_band2) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(ant_gain_5g_band2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ant_gain_5g_band3) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(ant_gain_5g_band3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_2g_lo) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_2g_lo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_2g_hi) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_2g_hi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_1_lo) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_1_lo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_1_hi) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_1_hi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_2a_lo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_2a_lo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_2a_hi) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_2a_hi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_2c_lo) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_2c_lo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_2c_hi) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_2c_hi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_3_lo) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_3_lo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_3_hi) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_3_hi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_4_lo) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_4_lo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_4_hi) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_4_hi)
        )
    );
}
#[repr(u32)]
#[doc = " @brief This enum defines different types of operating bands.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum op_band {
    #[doc = " All bands"]
    BAND_ALL = 0,
    #[doc = " 2.4Ghz band"]
    BAND_24G = 1,
}
#[doc = " @brief This structure defines the command responsible for initializing the UMAC.\n  After the host driver brings up, the host sends NRF_WIFI_CMD_INIT to the RPU.\n  The RPU then performs the initialization and responds with NRF_WIFI_EVENT_INIT_DONE\n  once the initialization is completed.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_sys_init {
    #[doc = " umac header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " id of the interface"]
    pub wdev_id: ::core::ffi::c_uint,
    #[doc = " @ref nrf_wifi_sys_params"]
    pub sys_params: nrf_wifi_sys_params,
    #[doc = " LMAC Rx buffs pool params, @ref rx_buf_pool_params"]
    pub rx_buf_pools: [rx_buf_pool_params; 3usize],
    #[doc = " Data configuration params, @ref nrf_wifi_data_config_params"]
    pub data_config_params: nrf_wifi_data_config_params,
    #[doc = " Calibration trigger control info based on battery voltage and temperature changes.\n  @ref temp_vbat_config from lmac_if_common.h"]
    pub temp_vbat_config_params: temp_vbat_config,
    #[doc = " 0:umac checksum disable 1: umac checksum enable"]
    pub tcp_ip_checksum_offload: ::core::ffi::c_uchar,
    #[doc = " Country code to set"]
    pub country_code: [::core::ffi::c_uchar; 2usize],
    #[doc = " Operating band see enum op_band"]
    pub op_band: ::core::ffi::c_uint,
    #[doc = " System parameters provided for controlling the TX power"]
    pub tx_pwr_ctrl_params: nrf_wifi_tx_pwr_ctrl_params,
    #[doc = " Offload mgmt buffer refill to UMAC when enabled"]
    pub mgmt_buff_offload: ::core::ffi::c_uchar,
    #[doc = " Enable features from driver config"]
    pub feature_flags: ::core::ffi::c_uint,
    #[doc = " To deactivate beamforming, By default the RPU enables the beamforming feature.\n  If a user wishes to turn it off, they should set this parameter to 1."]
    pub disable_beamforming: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_sys_init() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_sys_init> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_sys_init>(),
        334usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_sys_init))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_sys_init>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_sys_init))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wdev_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(wdev_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_params) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(sys_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_buf_pools) as usize - ptr as usize },
        243usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(rx_buf_pools)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_config_params) as usize - ptr as usize },
        255usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(data_config_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).temp_vbat_config_params) as usize - ptr as usize },
        266usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(temp_vbat_config_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tcp_ip_checksum_offload) as usize - ptr as usize },
        302usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(tcp_ip_checksum_offload)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).country_code) as usize - ptr as usize },
        303usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(country_code)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).op_band) as usize - ptr as usize },
        305usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(op_band)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pwr_ctrl_params) as usize - ptr as usize },
        309usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(tx_pwr_ctrl_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mgmt_buff_offload) as usize - ptr as usize },
        325usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(mgmt_buff_offload)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).feature_flags) as usize - ptr as usize },
        326usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(feature_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).disable_beamforming) as usize - ptr as usize },
        330usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(disable_beamforming)
        )
    );
}
#[doc = " @brief This structure defines the command used to de-initialize the RPU.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_sys_deinit {
    #[doc = " umac header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_sys_deinit() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_sys_deinit> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_sys_deinit>(),
        8usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_sys_deinit))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_sys_deinit>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_sys_deinit))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_deinit),
            "::",
            stringify!(sys_head)
        )
    );
}
#[doc = " @brief This structure defines the command used to configure\n  High-Efficiency Guard Interval(HE-GI) and High-Efficiency Long Training Field (HE-LTF).\n\n  HE-GI duration determines the guard interval length used in the HE transmission.\n  HE-LTF is used for channel estimation and signal detection in HE transmissions.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_he_gi_ltf_config {
    #[doc = " umac header, see &nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " wdev interface id"]
    pub wdev_id: ::core::ffi::c_uchar,
    #[doc = " HE GI type (NRF_WIFI_HE_GI_800NS/NRF_WIFI_HE_GI_1600NS/NRF_WIFI_HE_GI_3200NS)"]
    pub he_gi_type: ::core::ffi::c_uchar,
    #[doc = " HE LTF (NRF_WIFI_HE_LTF_3200NS/NRF_WIFI_HE_LTF_6400NS/NRF_WIFI_HE_LTF_12800NS)"]
    pub he_ltf: ::core::ffi::c_uchar,
    #[doc = " Fixed HE GI & LTF values can be enabled and disabled"]
    pub enable: ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_he_gi_ltf_config() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_he_gi_ltf_config> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_he_gi_ltf_config>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_he_gi_ltf_config))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_he_gi_ltf_config>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_he_gi_ltf_config))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_he_gi_ltf_config),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wdev_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_he_gi_ltf_config),
            "::",
            stringify!(wdev_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).he_gi_type) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_he_gi_ltf_config),
            "::",
            stringify!(he_gi_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).he_ltf) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_he_gi_ltf_config),
            "::",
            stringify!(he_ltf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_he_gi_ltf_config),
            "::",
            stringify!(enable)
        )
    );
}
#[repr(u32)]
#[doc = " @brief This enum represents the different types of preambles used.\n  Preambles are sequences of known symbols transmitted before the actual\n  data transmission to enable synchronization, channel estimation, and\n  frame detection at the receiver.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rpu_pkt_preamble {
    #[doc = " Short preamble packet"]
    RPU_PKT_PREAMBLE_SHORT = 0,
    #[doc = " Long preamble packet"]
    RPU_PKT_PREAMBLE_LONG = 1,
    #[doc = " mixed preamble packet"]
    RPU_PKT_PREAMBLE_MIXED = 2,
    #[doc = " Highest preamble type currently defined"]
    RPU_PKT_PREAMBLE_MAX = 3,
}
#[doc = " @brief This structure describes different Physical Layer (PHY) configuration parameters used\n  in RF test and Radio test scenarios. These parameters are specific to testing and evaluating\n  the performance of the radio hardware.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_conf_params {
    #[doc = " Unused. Number of spatial streams supported. Support is there for 1x1 only."]
    pub nss: ::core::ffi::c_uchar,
    #[doc = " Unused"]
    pub antenna_sel: ::core::ffi::c_uchar,
    #[doc = " An array containing RF & baseband control params"]
    pub rf_params: [::core::ffi::c_uchar; 200usize],
    #[doc = " Not required"]
    pub tx_pkt_chnl_bw: ::core::ffi::c_uchar,
    #[doc = " WLAN packet formats. 0->Legacy 1->HT 2->VHT 3->HE(SU) 4->HE(ERSU) and 5->HE(TB)"]
    pub tx_pkt_tput_mode: ::core::ffi::c_uchar,
    #[doc = " Short Guard enable/disable"]
    pub tx_pkt_sgi: ::core::ffi::c_uchar,
    #[doc = " Not required"]
    pub tx_pkt_nss: ::core::ffi::c_uchar,
    #[doc = " Preamble type. 0->short, 1->Long and 2->Mixed"]
    pub tx_pkt_preamble: ::core::ffi::c_uchar,
    #[doc = " Not used"]
    pub tx_pkt_stbc: ::core::ffi::c_uchar,
    #[doc = " 0->BCC 1->LDPC. Supporting only BCC in nRF7002"]
    pub tx_pkt_fec_coding: ::core::ffi::c_uchar,
    #[doc = " Valid MCS number between 0 to 7"]
    pub tx_pkt_mcs: ::core::ffi::c_schar,
    #[doc = " Legacy rate to be used in Mbps (1, 2, 5.5, 11, 6, 9, 12, 18, 24, 36, 48, 54)"]
    pub tx_pkt_rate: ::core::ffi::c_schar,
    #[doc = " Copy OTP params to this memory"]
    pub phy_threshold: ::core::ffi::c_schar,
    #[doc = " Calibration bit map value. refer NRF_WIFI_DEF_PHY_CALIB"]
    pub phy_calib: ::core::ffi::c_uint,
    #[doc = " Radio test mode or System mode selection"]
    pub op_mode: ::core::ffi::c_int,
    #[doc = " Channel related info viz, channel, bandwidth, primary 20 offset"]
    pub chan: chan_params,
    #[doc = " Value of 0 means continuous transmission.Greater than 1 is invalid"]
    pub tx_mode: ::core::ffi::c_uchar,
    #[doc = " Number of packets to be transmitted. Any number above 0.\n  Set -1 for continuous transmission"]
    pub tx_pkt_num: ::core::ffi::c_int,
    #[doc = " Length of the packet (in bytes) to be transmitted"]
    pub tx_pkt_len: ::core::ffi::c_ushort,
    #[doc = " Desired TX power in dBm in the range 0 dBm to 21 dBm in steps of 1 dBm"]
    pub tx_power: ::core::ffi::c_uint,
    #[doc = " Transmit WLAN packet"]
    pub tx: ::core::ffi::c_uchar,
    #[doc = " Receive WLAN packet"]
    pub rx: ::core::ffi::c_uchar,
    #[doc = "  Not required"]
    pub aux_adc_input_chain_id: ::core::ffi::c_uchar,
    #[doc = "  Unused"]
    pub agg: ::core::ffi::c_uchar,
    #[doc = " Select HE LTF type viz, 0->1x, 1->2x and 2->4x"]
    pub he_ltf: ::core::ffi::c_uchar,
    #[doc = " Select HE LTF type viz, 0->0.8us, 1->1.6us and 2->3.2us"]
    pub he_gi: ::core::ffi::c_uchar,
    #[doc = " Not required"]
    pub set_he_ltf_gi: ::core::ffi::c_uchar,
    #[doc = " Not required"]
    pub power_save: ::core::ffi::c_uchar,
    #[doc = " Not required"]
    pub rts_threshold: ::core::ffi::c_uint,
    #[doc = " Not required"]
    pub uapsd_queue: ::core::ffi::c_uint,
    #[doc = " Interval between TX packets in us (Min: 200, Max: 200000, Default: 200)"]
    pub tx_pkt_gap_us: ::core::ffi::c_uint,
    #[doc = " Configure WLAN antenna switch(0-separate/1-shared)"]
    pub wlan_ant_switch_ctrl: ::core::ffi::c_uchar,
    #[doc = " Switch to control the BLE antenna or shared WiFi antenna"]
    pub ble_ant_switch_ctrl: ::core::ffi::c_uchar,
    #[doc = " Resource unit (RU) size (26,52,106 or 242)"]
    pub ru_tone: ::core::ffi::c_uchar,
    #[doc = " Location of resource unit (RU) in 20 MHz spectrum"]
    pub ru_index: ::core::ffi::c_uchar,
    #[doc = " Desired tone frequency to be transmitted"]
    pub tx_tone_freq: ::core::ffi::c_schar,
    #[doc = " RX LNA gain"]
    pub lna_gain: ::core::ffi::c_uchar,
    #[doc = " RX BB gain"]
    pub bb_gain: ::core::ffi::c_uchar,
    #[doc = " Number of RX samples to be captured"]
    pub capture_length: ::core::ffi::c_ushort,
    #[doc = " Configure WLAN to bypass regulatory"]
    pub bypass_regulatory: ::core::ffi::c_uchar,
    #[doc = " Two letter country code (00: Default for WORLD)"]
    pub country_code: [::core::ffi::c_uchar; 2usize],
    #[doc = " Contention window value to be configured"]
    pub tx_pkt_cw: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_rpu_conf_params() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_conf_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_conf_params>(),
        280usize,
        concat!("Size of: ", stringify!(rpu_conf_params))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_conf_params>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_conf_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nss) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(nss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).antenna_sel) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(antenna_sel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rf_params) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(rf_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_chnl_bw) as usize - ptr as usize },
        202usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_chnl_bw)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_tput_mode) as usize - ptr as usize },
        203usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_tput_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_sgi) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_sgi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_nss) as usize - ptr as usize },
        205usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_nss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_preamble) as usize - ptr as usize },
        206usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_preamble)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_stbc) as usize - ptr as usize },
        207usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_stbc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_fec_coding) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_fec_coding)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_mcs) as usize - ptr as usize },
        209usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_mcs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_rate) as usize - ptr as usize },
        210usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_rate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_threshold) as usize - ptr as usize },
        211usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(phy_threshold)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_calib) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(phy_calib)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).op_mode) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(op_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).chan) as usize - ptr as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(chan)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_mode) as usize - ptr as usize },
        233usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_num) as usize - ptr as usize },
        234usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_len) as usize - ptr as usize },
        238usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_power) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_power)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx) as usize - ptr as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx) as usize - ptr as usize },
        245usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(rx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aux_adc_input_chain_id) as usize - ptr as usize },
        246usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(aux_adc_input_chain_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).agg) as usize - ptr as usize },
        247usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(agg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).he_ltf) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(he_ltf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).he_gi) as usize - ptr as usize },
        249usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(he_gi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).set_he_ltf_gi) as usize - ptr as usize },
        250usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(set_he_ltf_gi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).power_save) as usize - ptr as usize },
        251usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(power_save)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rts_threshold) as usize - ptr as usize },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(rts_threshold)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uapsd_queue) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(uapsd_queue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_gap_us) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_gap_us)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wlan_ant_switch_ctrl) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(wlan_ant_switch_ctrl)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ble_ant_switch_ctrl) as usize - ptr as usize },
        265usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(ble_ant_switch_ctrl)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_tone) as usize - ptr as usize },
        266usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(ru_tone)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_index) as usize - ptr as usize },
        267usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(ru_index)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_tone_freq) as usize - ptr as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_tone_freq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lna_gain) as usize - ptr as usize },
        269usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(lna_gain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bb_gain) as usize - ptr as usize },
        270usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(bb_gain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).capture_length) as usize - ptr as usize },
        271usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(capture_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bypass_regulatory) as usize - ptr as usize },
        273usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(bypass_regulatory)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).country_code) as usize - ptr as usize },
        274usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(country_code)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_cw) as usize - ptr as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_cw)
        )
    );
}
#[doc = " @brief This structure defines the command used to configure the RPU with different\n  PHY configuration parameters specifically designed for RF test and Radio test scenarios.\n  The command is intended to set up the RPU for testing and evaluating the performance\n  of the radio hardware.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_mode_params {
    #[doc = " UMAC header, See &struct nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " configuration parameters of different modes see &union rpu_conf_params"]
    pub conf: rpu_conf_params,
    #[doc = " Packet length"]
    pub pkt_length: [::core::ffi::c_ushort; 16usize],
    #[doc = " Packet ddr pointer"]
    pub ddr_ptrs: [::core::ffi::c_uint; 16usize],
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_mode_params() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_mode_params> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_mode_params>(),
        384usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_mode_params))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_mode_params>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_mode_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_mode_params),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conf) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_mode_params),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pkt_length) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_mode_params),
            "::",
            stringify!(pkt_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ddr_ptrs) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_mode_params),
            "::",
            stringify!(ddr_ptrs)
        )
    );
}
#[doc = " @brief This structure represents the parameters required to initialize a radio test.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_radio_test_init_info {
    #[doc = " An array containing RF & baseband control params"]
    pub rf_params: [::core::ffi::c_uchar; 200usize],
    #[doc = " Channel related info viz, channel, bandwidth, primary 20 offset"]
    pub chan: chan_params,
    #[doc = " Phy threshold value to be sent to LMAC in channel programming"]
    pub phy_threshold: ::core::ffi::c_schar,
    #[doc = " Calibration bit map value. refer phy_rf_params.h NRF_WIFI_DEF_PHY_CALIB"]
    pub phy_calib: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_nrf_wifi_radio_test_init_info() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_radio_test_init_info> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_radio_test_init_info>(),
        218usize,
        concat!("Size of: ", stringify!(nrf_wifi_radio_test_init_info))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_radio_test_init_info>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_radio_test_init_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rf_params) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_radio_test_init_info),
            "::",
            stringify!(rf_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).chan) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_radio_test_init_info),
            "::",
            stringify!(chan)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_threshold) as usize - ptr as usize },
        213usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_radio_test_init_info),
            "::",
            stringify!(phy_threshold)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_calib) as usize - ptr as usize },
        214usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_radio_test_init_info),
            "::",
            stringify!(phy_calib)
        )
    );
}
#[doc = " @brief This structure defines the command used to initialize a radio test.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_radio_test_init {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " radiotest init configuration parameters @ref nrf_wifi_radio_test_init_info"]
    pub conf: nrf_wifi_radio_test_init_info,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_radio_test_init() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_radio_test_init> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_radio_test_init>(),
        226usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_radio_test_init))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_radio_test_init>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_radio_test_init))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_radio_test_init),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conf) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_radio_test_init),
            "::",
            stringify!(conf)
        )
    );
}
#[doc = " @brief This structure defines the command used to enable or disable the reception (Rx).\n  It allows controlling the radio hardware's receive functionality to start or stop listening\n  for incoming data frames."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_rx {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " rx configuration parameters @ref rpu_conf_rx_radio_test_params"]
    pub conf: rpu_conf_rx_radio_test_params,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_rx() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_rx> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_rx>(),
        228usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_rx))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_rx>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_rx))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_rx),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conf) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_rx),
            "::",
            stringify!(conf)
        )
    );
}
#[doc = " @brief This structure defines the command used to retrieve statistics from the RPU.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_get_stats {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " Statistics type &enum rpu_stats_type"]
    pub stats_type: ::core::ffi::c_int,
    #[doc = " Production mode or FCM mode"]
    pub op_mode: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_get_stats() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_get_stats> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_get_stats>(),
        16usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_get_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_get_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_get_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_get_stats),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stats_type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_get_stats),
            "::",
            stringify!(stats_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).op_mode) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_get_stats),
            "::",
            stringify!(op_mode)
        )
    );
}
#[doc = " @brief This structure defines the command used to clear or reset statistics.\n\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_clear_stats {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " Type of statistics to clear &enum rpu_stats_type"]
    pub stats_type: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_clear_stats() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_clear_stats> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_clear_stats>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_clear_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_clear_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_clear_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_clear_stats),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stats_type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_clear_stats),
            "::",
            stringify!(stats_type)
        )
    );
}
#[doc = " @brief This structure represents the command used to obtain power monitor information\n  specific to different data types.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_pwr {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " Type of Control info that host need"]
    pub data_type: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_pwr() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_pwr> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_pwr>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_pwr))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_pwr>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_pwr))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_pwr),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_pwr),
            "::",
            stringify!(data_type)
        )
    );
}
#[doc = " @brief Structure for coexistence (coex) switch configuration.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct coex_wlan_switch_ctrl {
    #[doc = " Host to coexistence manager message id"]
    pub rpu_msg_id: ::core::ffi::c_int,
    #[doc = " Switch configuration value"]
    pub switch_A: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_coex_wlan_switch_ctrl() {
    const UNINIT: ::core::mem::MaybeUninit<coex_wlan_switch_ctrl> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<coex_wlan_switch_ctrl>(),
        8usize,
        concat!("Size of: ", stringify!(coex_wlan_switch_ctrl))
    );
    assert_eq!(
        ::core::mem::align_of::<coex_wlan_switch_ctrl>(),
        1usize,
        concat!("Alignment of ", stringify!(coex_wlan_switch_ctrl))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rpu_msg_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(coex_wlan_switch_ctrl),
            "::",
            stringify!(rpu_msg_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).switch_A) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(coex_wlan_switch_ctrl),
            "::",
            stringify!(switch_A)
        )
    );
}
#[doc = " @brief The structure represents the command used to configure the Wi-Fi side shared switch\n  for Bluetooth coexistence (btcoex).\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_btcoex {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " Switch configuration data"]
    pub conf: coex_wlan_switch_ctrl,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_btcoex() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_btcoex> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_btcoex>(),
        16usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_btcoex))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_btcoex>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_btcoex))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_btcoex),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conf) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_btcoex),
            "::",
            stringify!(conf)
        )
    );
}
#[doc = " @brief The structure defines the parameters used to configure the coexistence hardware.\n"]
#[repr(C, packed)]
pub struct rpu_cmd_coex_config_info {
    #[doc = " Length of coexistence configuration data"]
    pub len: ::core::ffi::c_uint,
    #[doc = " Coexistence configuration data"]
    pub coex_cmd: __IncompleteArrayField<::core::ffi::c_uchar>,
}
#[test]
fn bindgen_test_layout_rpu_cmd_coex_config_info() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_cmd_coex_config_info> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_cmd_coex_config_info>(),
        4usize,
        concat!("Size of: ", stringify!(rpu_cmd_coex_config_info))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_cmd_coex_config_info>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_cmd_coex_config_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_cmd_coex_config_info),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).coex_cmd) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_cmd_coex_config_info),
            "::",
            stringify!(coex_cmd)
        )
    );
}
#[doc = " @brief This structure defines the command used to configure the coexistence hardware.\n"]
#[repr(C, packed)]
pub struct nrf_wifi_cmd_coex_config {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " Coexistence configuration data. @ref rpu_cmd_coex_config_info"]
    pub coex_config_info: rpu_cmd_coex_config_info,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_coex_config() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_coex_config> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_coex_config>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_coex_config))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_coex_config>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_coex_config))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_coex_config),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).coex_config_info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_coex_config),
            "::",
            stringify!(coex_config_info)
        )
    );
}
#[doc = " @brief This structure describes the coexistence configuration data received\n  in the NRF_WIFI_EVENT_COEX_CONFIG event.\n"]
#[repr(C, packed)]
pub struct rpu_evnt_coex_config_info {
    #[doc = " Length of coexistence configuration data"]
    pub len: ::core::ffi::c_uint,
    #[doc = " Coexistence configuration data"]
    pub coex_event: __IncompleteArrayField<::core::ffi::c_uchar>,
}
#[test]
fn bindgen_test_layout_rpu_evnt_coex_config_info() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_evnt_coex_config_info> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_evnt_coex_config_info>(),
        4usize,
        concat!("Size of: ", stringify!(rpu_evnt_coex_config_info))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_evnt_coex_config_info>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_evnt_coex_config_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_evnt_coex_config_info),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).coex_event) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_evnt_coex_config_info),
            "::",
            stringify!(coex_event)
        )
    );
}
#[doc = " @brief This structure defines the event used to represent coexistence configuration.\n"]
#[repr(C, packed)]
pub struct nrf_wifi_event_coex_config {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " Coexistence configuration data in the event. @ref rpu_evnt_coex_config_info"]
    pub coex_config_info: rpu_evnt_coex_config_info,
}
#[test]
fn bindgen_test_layout_nrf_wifi_event_coex_config() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_event_coex_config> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_event_coex_config>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_event_coex_config))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_event_coex_config>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_event_coex_config))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_coex_config),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).coex_config_info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_coex_config),
            "::",
            stringify!(coex_config_info)
        )
    );
}
#[doc = " @brief This structure defines the command used to fix the transmission (Tx) data rate.\n  The command allows setting a specific data rate for data transmission, ensuring that the\n  system uses the designated rate instead of dynamically adapting to changing channel conditions.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_fix_tx_rate {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " refer see &enum rpu_tput_mode"]
    pub rate_flags: ::core::ffi::c_uchar,
    #[doc = " fixed_rate: -1 Disable fixed rate and use ratecontrol selected rate\n  fixed rate: >0 legacy rates: 1,2,55,11,6,9,12,18,24,36,48,54\n\t\t  11N VHT HE  : MCS index 0 to 7."]
    pub fixed_rate: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_fix_tx_rate() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_fix_tx_rate> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_fix_tx_rate>(),
        13usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_fix_tx_rate))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_fix_tx_rate>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_fix_tx_rate))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_fix_tx_rate),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rate_flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_fix_tx_rate),
            "::",
            stringify!(rate_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fixed_rate) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_fix_tx_rate),
            "::",
            stringify!(fixed_rate)
        )
    );
}
#[doc = " @brief This structure describes rf test command information.\n"]
#[repr(C, packed)]
pub struct rpu_cmd_rftest_info {
    #[doc = " length of the rf test command"]
    pub len: ::core::ffi::c_uint,
    #[doc = " Rf test command data"]
    pub rfcmd: __IncompleteArrayField<::core::ffi::c_uchar>,
}
#[test]
fn bindgen_test_layout_rpu_cmd_rftest_info() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_cmd_rftest_info> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_cmd_rftest_info>(),
        4usize,
        concat!("Size of: ", stringify!(rpu_cmd_rftest_info))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_cmd_rftest_info>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_cmd_rftest_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_cmd_rftest_info),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rfcmd) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_cmd_rftest_info),
            "::",
            stringify!(rfcmd)
        )
    );
}
#[doc = " @brief This structure defines the command used for RF (Radio Frequency) testing.\n  RF test commands are specifically designed to configure and control the radio hardware\n  for conducting tests and evaluating its performance in various scenarios.\n"]
#[repr(C, packed)]
pub struct nrf_wifi_cmd_rftest {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " @ref rpu_cmd_rftest_info"]
    pub rf_test_info: rpu_cmd_rftest_info,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_rftest() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_rftest> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_rftest>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_rftest))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_rftest>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_rftest))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_rftest),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rf_test_info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_rftest),
            "::",
            stringify!(rf_test_info)
        )
    );
}
#[doc = " @brief This structure describes rf test event information.\n"]
#[repr(C, packed)]
pub struct rpu_evnt_rftest_info {
    #[doc = " length of the rf test event"]
    pub len: ::core::ffi::c_uint,
    #[doc = " Rf test event data"]
    pub rfevent: __IncompleteArrayField<::core::ffi::c_uchar>,
}
#[test]
fn bindgen_test_layout_rpu_evnt_rftest_info() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_evnt_rftest_info> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_evnt_rftest_info>(),
        4usize,
        concat!("Size of: ", stringify!(rpu_evnt_rftest_info))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_evnt_rftest_info>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_evnt_rftest_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_evnt_rftest_info),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rfevent) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_evnt_rftest_info),
            "::",
            stringify!(rfevent)
        )
    );
}
#[doc = " @brief This structure describes the event generated during RF (Radio Frequency) testing.\n"]
#[repr(C, packed)]
pub struct nrf_wifi_event_rftest {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " @ref rpu_evnt_rftest_info"]
    pub rf_test_info: rpu_evnt_rftest_info,
}
#[test]
fn bindgen_test_layout_nrf_wifi_event_rftest() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_event_rftest> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_event_rftest>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_event_rftest))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_event_rftest>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_event_rftest))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_rftest),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rf_test_info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_rftest),
            "::",
            stringify!(rf_test_info)
        )
    );
}
#[doc = " @brief This structure represents the power data event generated in response to\n  the NRF_WIFI_CMD_PWR command.\n\n  The NRF_WIFI_CMD_PWR command is used to retrieve power-related data or measurements\n  from the radio hardware.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_event_pwr_data {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " Power monitor command status info"]
    pub mon_status: ::core::ffi::c_int,
    #[doc = " Data"]
    pub data_type: ::core::ffi::c_int,
    #[doc = " Data that host may want to read from Power IP"]
    pub data: nrf_wifi_rpu_pwr_data,
}
#[test]
fn bindgen_test_layout_nrf_wifi_event_pwr_data() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_event_pwr_data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_event_pwr_data>(),
        28usize,
        concat!("Size of: ", stringify!(nrf_wifi_event_pwr_data))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_event_pwr_data>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_event_pwr_data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_pwr_data),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mon_status) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_pwr_data),
            "::",
            stringify!(mon_status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_type) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_pwr_data),
            "::",
            stringify!(data_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_pwr_data),
            "::",
            stringify!(data)
        )
    );
}
#[doc = " @brief This structure is a comprehensive combination of all the firmware statistics\n  that the RPU (Radio Processing Unit) can provide.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_fw_stats {
    #[doc = " PHY statistics  @ref rpu_phy_stats"]
    pub phy: rpu_phy_stats,
    #[doc = " LMAC statistics @ref rpu_lmac_stats"]
    pub lmac: rpu_lmac_stats,
    #[doc = " UMAC statistics @ref rpu_umac_stats"]
    pub umac: rpu_umac_stats,
}
#[test]
fn bindgen_test_layout_rpu_fw_stats() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_fw_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_fw_stats>(),
        639usize,
        concat!("Size of: ", stringify!(rpu_fw_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_fw_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_fw_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_fw_stats),
            "::",
            stringify!(phy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_fw_stats),
            "::",
            stringify!(lmac)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac) as usize - ptr as usize },
        158usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_fw_stats),
            "::",
            stringify!(umac)
        )
    );
}
#[doc = " @brief This structure represents the event that provides RPU statistics in response\n  to the command NRF_WIFI_CMD_GET_STATS in a wireless communication system.\n\n  The NRF_WIFI_CMD_GET_STATS command is used to request various statistics from the RPU.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_umac_event_stats {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " All the statistics that the firmware can provide @ref rpu_fw_stats"]
    pub fw: rpu_fw_stats,
}
#[test]
fn bindgen_test_layout_nrf_wifi_umac_event_stats() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_umac_event_stats> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_umac_event_stats>(),
        647usize,
        concat!("Size of: ", stringify!(nrf_wifi_umac_event_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_umac_event_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_umac_event_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_umac_event_stats),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fw) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_umac_event_stats),
            "::",
            stringify!(fw)
        )
    );
}
#[repr(u32)]
#[doc = " @brief This enum defines various error status values that may occur during a radio test.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_radio_test_err_status {
    #[doc = " Command success"]
    NRF_WIFI_UMAC_CMD_SUCCESS = 1,
    #[doc = " Invalid channel error"]
    NRF_WIFI_UMAC_INVALID_CHNL = 2,
}
#[doc = " @brief This structure defines an event that indicates the error status values that may occur\n  during a radio test. It serves as a response to the radio test commands.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_umac_event_err_status {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " status of the command, Fail/success &enum nrf_wifi_radio_test_err_status"]
    pub status: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_nrf_wifi_umac_event_err_status() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_umac_event_err_status> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_umac_event_err_status>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_umac_event_err_status))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_umac_event_err_status>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_umac_event_err_status))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_umac_event_err_status),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_umac_event_err_status),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief This structure represents the UMAC initialization done event.\n  The event is sent by the RPU (Radio Processing Unit) in response to\n  the NRF_WIFI_CMD_INIT command, indicating that the RPU initialization\n  process has been completed successfully."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_event_init_done {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
}
#[test]
fn bindgen_test_layout_nrf_wifi_event_init_done() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_event_init_done> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_event_init_done>(),
        8usize,
        concat!("Size of: ", stringify!(nrf_wifi_event_init_done))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_event_init_done>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_event_init_done))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_init_done),
            "::",
            stringify!(sys_head)
        )
    );
}
#[doc = " @brief structure for UMAC memory pool information.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct pool_data_to_host {
    #[doc = " Size of the memory buffer"]
    pub buffer_size: ::core::ffi::c_uint,
    #[doc = " Number of pool items available for the above memory buffer"]
    pub num_pool_items: ::core::ffi::c_uchar,
    #[doc = " Maximum pools allocated at any point of time"]
    pub items_num_max_allocated: ::core::ffi::c_uchar,
    #[doc = " Currently allocated pools"]
    pub items_num_cur_allocated: ::core::ffi::c_uchar,
    #[doc = " Total number of pool allocated"]
    pub items_num_total_allocated: ::core::ffi::c_uint,
    #[doc = " Number of times this memory pool is full"]
    pub items_num_not_allocated: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_pool_data_to_host() {
    const UNINIT: ::core::mem::MaybeUninit<pool_data_to_host> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pool_data_to_host>(),
        15usize,
        concat!("Size of: ", stringify!(pool_data_to_host))
    );
    assert_eq!(
        ::core::mem::align_of::<pool_data_to_host>(),
        1usize,
        concat!("Alignment of ", stringify!(pool_data_to_host))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buffer_size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pool_data_to_host),
            "::",
            stringify!(buffer_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_pool_items) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pool_data_to_host),
            "::",
            stringify!(num_pool_items)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).items_num_max_allocated) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(pool_data_to_host),
            "::",
            stringify!(items_num_max_allocated)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).items_num_cur_allocated) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(pool_data_to_host),
            "::",
            stringify!(items_num_cur_allocated)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).items_num_total_allocated) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(pool_data_to_host),
            "::",
            stringify!(items_num_total_allocated)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).items_num_not_allocated) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(pool_data_to_host),
            "::",
            stringify!(items_num_not_allocated)
        )
    );
}
#[doc = " @brief This structure represents the event that provides UMAC (Upper MAC) internal\n  memory statistics in response to the NRF_WIFI_CMD_UMAC_INT_STATS command.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct umac_int_stats {
    #[doc = " UMAC header, @ref nrf_wifi_sys_head"]
    pub sys_head: nrf_wifi_sys_head,
    #[doc = " See @ref pool_data_to_host"]
    pub scratch_dynamic_memory_info: [pool_data_to_host; 56usize],
    #[doc = " See @ref pool_data_to_host"]
    pub retention_dynamic_memory_info: [pool_data_to_host; 56usize],
}
#[test]
fn bindgen_test_layout_umac_int_stats() {
    const UNINIT: ::core::mem::MaybeUninit<umac_int_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<umac_int_stats>(),
        1688usize,
        concat!("Size of: ", stringify!(umac_int_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<umac_int_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(umac_int_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_int_stats),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).scratch_dynamic_memory_info) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_int_stats),
            "::",
            stringify!(scratch_dynamic_memory_info)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).retention_dynamic_memory_info) as usize - ptr as usize
        },
        848usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_int_stats),
